Repository: hrubymar10/wesnoth-cs
Catalog: add-ons/wesnoth-ala.po
Languages: cs

source: Having defeated the Saurians and re-established the trade relations with the Nereids, Glauco could finally return to Amoran bringing with him a lot of good news. To think that the town could relive its past splendor was not yet possible, but, besides the renewed traffic of amber, the wild lands were a little less savage than before, and this could attract settlers from the west; could attract people endowed with courage and spirit of initiative, qualities that, for Glauco, were worth more than a few pieces of gold.
cs: Poté, co porazil ještěráky a znovu navázal obchodní vztahy s nereidami, mohl se Glauko konečně vrátit do Amoranu a přinést s sebou spoustu dobrých zpráv. Nemohl si ještě pomyslet na to, že by město mohlo znovu dojít svého bývalého lesku. Ale kromě obnovené dopravy jantaru se mu podařilo dosáhnout toho, že divoká krajina byla o něco méně divoká než dříve, což mohlo přilákat osadníky ze západu, lidi obdařené odvahou a duchem iniciativy, vlastnostmi, které pro Glauka měly větší cenu než zlaté kamení.

source: But, having come to the town, Glauco had to see that someone, with a lot of fighting spirit and sense of initiative, had already arrived, but had not brought anything that the good and peaceful people of Amoran could really appreciate. Where the small field camp of Grunto's tribe had arisen for the short space of a few days previously, there was now a solid Orcish fortress, and the number of huts surrounding it announced the presence of a considerable number of orcs.
cs: Když však Glauko dorazil do města, nemohl nevidět, že někdo s velkým bojovým duchem a smyslem pro iniciativu už dorazil. Nepřinesl však nic, co by dobří a mírumilovní lidé z Amoranu mohli skutečně ocenit. Tam, kde před několika dny na krátkou dobu vyrostl malý polní tábor Gruntova kmene, byla nyní pevná skřetí pevnost a množství chatrčí kolem ní oznamovalo přítomnost značného počtu skřetů.

source: Suddenly, Glauco was extremely happy that the men he had with him had accumulated a good amount of combat experience; and he was as much happy that Glubtrub and his ogres, struck by the sudden curiosity to see how a human town was made, were still with him.
cs: Glauko byl najednou nesmírně šťastný, že muži, které měl s sebou, nasbírali značné množství bojových zkušeností. Stejně byl štastný z toho, že Glubtrub a jeho obři, zasaženi náhlou zvědavostí vidět lidské město, jsou stále s ním.

source: The news of the defeat of Gan-Tarkas quickly reached before Soradoc and then Weldyn; just as quickly Glauco was summoned to the capital city, where the king wanted to know, by word and by sign, because events so resounding were happening, without his knowledge, in lands that, often, even he didn't remember being subject to his crown.
cs: Zpráva o porážce Gan-Tarkase rychle dorazila do Soradoku a poté do Weldynu. Stejně rychle byl Glauko povolán do hlavního města, kde ho chtěl král na vlastní oči vidět a na vlastní uši slyšet. Neboť tak zvučné události se odehrávaly bez jeho vědomí v zemích, u kterých si často ani on nepamatoval, že by byly podrobeny jeho koruně.

source: Glauco and Geobard went to the capital to report, on what had happened, to their august and a little distracted sovereign. When the mission was accomplished, the sergeant Glauco found himself promoted to general without having been an officer before. When the king asked him what garrison he wanted to be assigned to, he replied, after a brief reflection - Amoran will be fine, there is a lot of work to do, again, and I don't like to leave things in half - And there were many things to do in Amoran, but Glauco, who was also appointed civil governor of the town and of all the wild lands to the east of it, did it with enthusiasm, because he had grown fond of the place, and the large cities of the west seemed now, to him, suffocating.
cs: Glauko a Geobard odjeli do hlavního města podat svému vznešenému (a trochu roztržitému) panovníkovi zprávu o tom, co se událo. Poté, co se tak stalo, zjistil Glauko, že byl povýšen na generála, aniž by předtím sloužil jako důstojník. Když se ho král zeptal, do jaké posádky chce být přidělen, po krátkém zamyšlení odpověděl, že Amoran mu bude vyhovovat, protože je tam zase spousta práce a on nerad nechává věci nedodělané. A v Amoranu čekalo mnoho práce. Ale Glauko, který byl také jmenován civilním guvernérem města a všech divokých zemí na východ od něj, ji dělal s nadšením, protože si to místo oblíbil a velká města na západě se mu teď zdála dusivá.

source: The renewed amber trade did not bring to the town all the benefits that Glauco had hoped, but the market that was held there twice a year, in spring and autumn, when the Nereids went up the river, slowly spread the notoriety of the place in all the kingdom and in the lands of the northern alliance, thus ending up attracting settlers eager for new spaces and willing to spend effort and sweat to build something; the wild lands became a little less savage and a little more inhabited; nothing that, for heaven's sake, the land was so great and the colonists were still few, but it was enough because the decadence of Amoran would undergo a quiet but constant rebirth.
cs: Obnovený obchod s jantarem nepřinesl městu všechny benefity, v které Glauko doufal, nicméně trh, který se zde konal dvakrát ročně, na jaře a na podzim, když nereidy dorazily po řece, pomalu šířil proslulost tohoto místa v celém království a v zemích Severní aliance. Což vyústilo v přilákání osadníků toužících po nových prostorech a ochotných vynaložit budovatelské úsilí a námahu. Divoké země se staly o něco méně divokými a o něco více obydlenými. Ne že by snad, proboha, zcela civilizovanými, na to byla země příliš velká a kolonistů málo. Ale stačilo to na to, aby dekadence Amoranu mohla projít tichým, ale neustávajícím znovuzrozením.

source: Geobard was promoted by the King himself, so he returned to Soradoc, where he became the trustworthy man of the count, as well as the same of many of the ladies of the court.
cs: Geobarda povýšil sám král. Vrátil se do Soradoku, kde se stal důvěrníkem hraběte, stejně jako mnoha dvorních dam.

source: To Glubtrub and the tribe of the old post station were given perpetual concession to the territory in which they lived, and only the Nereids were given permission to cross that territory without the explicit consent of the Ogre; moreover, because it was known that who attacked the ogres would have to deal with the dreaded exterminator of Orcs named Glauco, the life of the tribe was, in the following years, extraordinarily peaceful, for a tribe of Ogre at least.
cs: Glubtrubovi a jeho soukmenovcům od staré přepřahací stanice byly uděleny trvalé koncese na území, na kterém žili. Pouze nereidy dostaly povolení překračovat toto území bez výslovného souhlasu obrů. Navíc, protože se vědělo, že ten, kdo zaútočil na obry, se bude muset vypořádat s obávaným hubitelem skřetů jménem Glauko, byl život kmene v následujících letech mimořádně poklidný. Tedy alespoň na kmen obrů.

source: Because of so much prosperity, always according to an ogre judgment, Glubtrub would have been remembered, in the small history of his tribe, as Glubtrub the Great, but the progressive expansion of his waistline finally earned him the name of the Glubtrub the Enormous.
cs: Díky této prosperitě, uvažováno z obřího hlediska, bude Glubtrub pamatován v malé historii svého kmene jako Glubtrub Veliký, nebo, v důsledku své postupné vypasenosti, jako Glubtrub Obrovský.

source: Croquet returned to his life in the woods, along with his 'girlfriend', but returned to Amoran whenever he wanted to drink a good beer with friends and to tell some strange facts that he thought Glauco might be interested in.
cs: Kroket se vrátil ke svému životu v lesích spolu se svou „přítelkyní“. Do Amoranu se ale vracel, kdykoli si chtěl s přáteli vypít dobré pivo a poklábosit o nějakých nezvyklostech, které by podle něj mohly Glauka zajímat.

source: Croquet returned to his life in the woods, but he was sad without his 'girlfriend', so he returned to Amoran whenever he wanted a good beer and equally good company, and Glauco, every time he saw him coming, was careful not to let him never miss one or the other.
cs: Kroket se vrátil ke svému životu v lesích, ale bez jeho „přítelkyně“ mu bylo smutno. A tak se vracel do Amoranu, kdykoli měl chuť na dobré pivo a dobrou společnost. Glauko pokaždé, když ho viděl přicházet, dával pozor, aby mu nikdy nechybělo ani jedno, ani druhé.

source: Fangy had stayed with Glauco until the end of the battle against Gan-Tarkas, simply because that was what Croquet would do; then she disappeared, and no one ever saw her again! Glauco, having just become civil governor of all the territories of the east, in memory of the old trapper, decreed the absolute prohibition of killing wolves in the territories subject to him, if not for personal defense, under penalty of expulsion from the territory.
cs: Fangy zůstala s Glaukem až do konce bitvy proti Gan-Tarkasovi, protože tak by to Kroket udělal. Pak zmizela a už ji nikdo nikdy neviděl! Glauko, který se právě stal civilním guvernérem všech území na východě, na památku starého lovce nařídil pod trestem vyhnání z území absolutní zákaz zabíjení vlků na územích, která mu podléhala, s výjimkou vlastní obrany.

source: Divaid and Ranfy returned to their woods, mumbling that they had helped the Wesnothians to fill their house of westerner yahoos; but they didn't really have to give them those nosecrops, since when they lost something or someone, or lost themselves in those unknown territories, Ranfy was always ready to hover in the sky and put his very sharp sight at disposal to find what or who had been missing.
cs: Divaid a Ranfy se vrátili do svých lesů, brblajíce, jak pomohli wesnothským naplnit ega jejich zápaďáckým fanfarónstvím. Ale ve skutečnosti to bylo jen takové mumlání pod fousy pro zachování formy. Protože když bylo něco ztraceno nebo se někdo ztratil v těch neznámých územích, Ranfy byl vždy připraven vznést se k obloze a dát k dispozici svůj velmi ostrý zrak, aby našel to, co bylo ztraceno, nebo toho, kdo byl nezvěstný.

source: Divaid returned to his life in the woods, but he was sad without his friend, so he returned to Amoran whenever he wanted a good beer and equally good company, and Glauco, every time he saw him coming, was careful not to let him never miss one or the other.
cs: Divaid se vrátil ke svému životu v lesích, ale bez jeho přítele mu bylo smutno. A tak se vracel do Amoranu, kdykoli měl chuť na dobré pivo a dobrou společnost. Glauko pokaždé, když ho viděl přicházet, dával pozor, aby mu nikdy nechybělo ani jedno, ani druhé.

source: Ranfy disappeared immediately after the end of the battle against Gan-Tarkas. He returned two months later, with a companion, and made his nest over the only tower left of the old walls of Amoran. The citizens were initially frightened, moreover many of them had never seen a gryphon before, but Glauco reassured them by explaining that the gryphons were not a danger, but rather the best sentries that Amoran could have, and soon the gryphons were considered citizens of Amoran like everyone else.
cs: Ranfy zmizel hned poté, co skončila bitva proti Gan-Tarkasovi. O dva měsíce později se vrátil, a ne sám. Udělal si hnízdo na jediné věži, která zbyla ze starých zdí Amoranu. Občané byli zpočátku vyděšení, zvlášť když mnozí z nich nikdy předtím gryfy neviděli. Ale Glauko je uklidnil vysvětlením, že gryfové nepředstavují nebezpečí, ale spíše nejlepší stráže, které by Amoran mohl mít. Brzy byli gryfové považováni za občany Amoranu jako každý jiný.

source: Mimord remained in Amoran for a short time; then began to get bored and left for the north, looking for his old companions; in the end, even he didn't like being alone; with whom could you brawl if you are alone?
cs: Mimord zůstal v Amoranu krátce. Pak se začal nudit a odešel na sever hledat své staré společníky. Nakonec ani on nebyl rád sám. A s kým se můžeš rvát, když k tomu nikoho nemáš?

source: Glauco and his friends had other adventures later, as was inevitable for those who were called to manage a territory so vast in which they still lived many strange, wonderful and horrible creatures.
cs: Glauko a jeho přátelé zažili později i další dobrodružství. Neboť pro ty, kteří byli povoláni spravovat území tak rozsáhlé a stále obydlené mnoha podivnými, úžasnými i hroznými tvory, to bylo nevyhnutelným údělem.

source: Glauco did not mind at all, in his serene old age, to tell his adventures to anyone asked him, sons, nephews, or great-grandchildren that they were; but to those who asked him how he managed to become an important man, he always began by saying - Oh, that time was just a little adventure -
cs: Glaukovi vůbec nevadilo, když během svého klidného stáří vyprávěl o svých dobrodružstvích každému, kdo se ho zeptal, ať už synům, synovcům či pravnukům. Ale všem, kteří se ho ptali, jak se mu podařilo stát se důležitým mužem, vždy začínal odpovídat slovy – Ach, tenkrát to bylo jen takové malé dobrodružství...
