Repository: hrubymar10/wesnoth-cs
Catalog: add-ons/wesnoth-ala.po
Languages: cs

source: My name is Glauco! I'm the commander of the Amoran's garrison, and I'm trying to reach the nereid's bay at the mouth of the Amber River! And who would you be? I thought all the dwarves had left these hills.
cs: Jmenuji se Glauko! Jsem velitelem posádky Amoranu a snažím se dostat do zátoky nereid u ústí Jantarové řeky! A kdopak jsi ty? Myslel jsem, že všichni trpaslíci tyto kopce opustili.

source: They did so, in fact! There is only me, Mimord, here! I stayed here because the others said I was a troublemaker, so when they left I said, 'If I stay alone no one will call me a brawler,' and so... here I am, with nobody to fight against... apart wolves and bats! Ah, the boredom...
cs: Vskutku tak učinili! Jsem tu jen já, Mimord! Zůstal jsem tady, protože ostatní říkali, že jsem výtržník. Takže když odcházeli, řekl jsem: „Pokud zůstanu sám, nikdo mě nebude označovat za rváče,“ a tak... jsem tady. Nemám proti komu bojovat... kromě vlků a netopýrů! Ach ta nuda...

source: Ehm... Beh... We're sorry to have bothered you, but as you can see, we already have our troubles and we don't want to have other troubles with you! So, excuse us again, and have a good stay.
cs: Ehm... Eh... Promiň, že jsme tě obtěžovali. Ale jak vidíš, své trable už máme a další s tebou mít nechceme! Takže nás ještě jednou omluv a měj se hezky.

source: One moment... can I came with you? I've never seen the sea before, and besides... I'm sick of always having only the beasts to fight with around here! Maybe you will find new foes to fight with on your journey, and the undersigned will be happy to take some axes with you! Enlist me for, let's say... 50 pieces of gold!
cs: Moment... můžu jít s vámi? Nikdy předtím jsem neviděl moře, a kromě toho..., už mě nebaví mít za protivníky pořád jen ty zdejší bestie! Možná najdeš na své cestě nové nepřátele, kterým budeš čelit, a tví podřízení budou rádi, že je bude doprovázet nějaká ta sekera! Můžeš mě získat za řekněme... 50 zlatých!

source: In truth... we try to avoid problems when possible.
cs: Po pravdě... snažíme se problémům vyhýbat, když je to možné.

source: By my sister's moustache, that is a truly ridiculous statement, commander Glauco, from the mouth of someone who wants to cross these territories! Do you know what I tell you? You have won, I'll come with you for free; I am bored to death here.
cs: U kníru mé sestry, to je skutečně bláhové prohlášení, veliteli Glauko, z úst někoho, kdo chce přejít tato území! Víš, co ti nabízím? Vyhrál jsi, půjdu s vámi zadarmo. Jsem tu k smrti znuděný.

source: The dwarf is not all wrong! In my opinion it will do more good than bad if he comes with us! Although we should almost be near at the sea, we don't know what we'll find again, and then... there is always the return to Amoran.
cs: Ten trpaslík není úplně špatný. Když půjde s námi, udělá podle mého názoru víc užitku než zla! I když už bychom měli být skoro u moře, nevíme, co zase najdeme. A pak... vždy je tu návrat do Amoranu.

source: Then you can come with us, Mimord, but I will decide who to... attack, understood?
cs: Pak můžeš jít s námi, Mimorde, ale já budu rozhodovat... na koho zaútočíš, rozumíš?

source: Understood! You did a great deal, commander Glauco! But, by my cousin's hammer, you're one tough merchant, to get my services for nothing... my compliments, really.
cs: Rozumím! Uzavřel jsi skvělou dohodu, veliteli Glauko! Ale u kladiva mého bratrance..., jsi tvrdý obchodník. Získat moje služby za nic... před tím se skláním, opravdu.

source: Actually I don't... oh well, forget it and let's reach that monolith beyond the hills.
cs: Vlastně já nic... no, zapomeň na to a pojďme k tomu monolitu za kopci.

source: Urca! Bats ugly, Glubtrub to hate bats!
cs: Né! Netopýři oškliví, Glubtrub nenávidět netopýry!

source: How are you afraid of an animal that's so much smaller than you, Glubtrub?
cs: Jak se můžeš bát takového zvířete, které je o tolik menší než ty, Glubtrube?

source: No to have fear, but bats to have ugly taste! Bleah!
cs: Nemít strach, ale netopýři mít ošklivou chuť! Bléé!

source: And just so we won't miss anything, here are the wolves!
cs: A abychom o nic nepřišli, jsou tu vlci!

source: And just so we won't miss anything, here are the wolves! Beh, maybe Fangy could find a cute one and enlarge the family!
cs: A abychom o nic nepřišli, jsou tu vlci! Eh, možná by si Fangy mohla najít nějakého roztomilého a rozšířit rodinu!

source: Well, hey! I'm not complaining about what is lacking!
cs: No nazdar! Nestěžuji si na to, že by mi něco chybělo!

source: Welcome, foreigners! It's been a long time since we last saw the colors of Wesnoth around here! We wonder why you came back to us right now.
cs: Vítejte, cizinci! Už je to dlouho, co jsme tu naposledy viděli barvy Wesnothu! Jsme zvědaví, proč se k nám vracíte právě teď.

source: My greetings! I'm the commander Glauco, from Amoran. I came here to reopen the old Amber Road! There is someone in Wesnoth who came back from here who is mighty interested in it!
cs: Zdravím! Jsem velitel Glauko z Amoranu. Přišel jsem sem, abych znovu otevřel starou Jantarovou stezku! Ve Wesnothu je někdo, kdo se odsud vrátil a má o to velký zájem!

source: As you are here, I deduce that you have already gotten rid of the Nagas that had gone up the river years ago: and the presence of an ogre in your row also makes me infer that you have already solved any problems with other wild creatures; but I fear that you'll find here your biggest problem.
cs: Z toho, že jste tady, usuzuji, že jste se již zbavili nág, které před lety vyrazily na řeku. A z přítomnosti obra ve vašich řadách odvozuji, že jste již vyřešili i další problémy s ostatními divokými tvory. Ale obávám se, že zde najdete svůj největší problém.

source: Oh, for that, we are already used to facing problems of any kind! What's the ones here?
cs: Ach, a proto jsme již navykli čelit problémům jakéhokoli druhu! O co jde tady?

source: The deposits of amber, on the island opposite the mouth of the river, are no longer controlled by the Nereids, but by the saurians! And they make our life difficult even if we search for amber pebbles in the depths along the coast.
cs: Ložiska jantaru, na ostrově naproti ústí řeky, už neovládáme my, ale ještěráci! A ti nám ztěžují život, i když hledáme jantarové oblázky v hlubinách podél pobřeží.

source: Urca! Lizards more worst mess, more leatherish of snakes to chew, more hard squash them, small, fast, sting with lance and makes strange things with cold light!
cs: Fůj! S ještěrkama to být ještě horší než s hadama! Když žvýkat je, tak víc kožovité, když mačkat je, tak tvrdší. Být malé, rychlé, bodat kopíma a dělat divné věci studeným světlem!

source: Yet, without the possibility of having amber, all the efforts made to get here have been in vain! But how did they settle on your islands?
cs: No, bez možnosti se dostat k jantaru by bylo veškeré úsilí vynaložené k tomu, abychom se sem dostali, marné! Ale jak se usadili na vašich ostrovech?

source: During the coldest seasons, sometimes, we move to a bay further south for a month or two, when the water here becomes too cold, just like the last winter! When we returned here, at the beginning of spring, we found the saurians already on the islands; we wanted to drive them away, because those islands have been ours ever since our fathers arrived on this continent, but I didn't feel like throwing my people into a war with too uncertain of an outcome; our community is the smallest of all those present along the coasts of this continent.
cs: Během nejchladnějších období se někdy na měsíc nebo dva stěhujeme do zátoky jižněji. Hlavně když je zde voda příliš studená, stejně jako minulou zimu! Když jsme se sem začátkem jara vrátili, našli jsme ještěráky už na ostrovech. Chtěli jsme je odehnat, protože ty ostrovy byly naše od té doby, co naši otcové přišli na tento kontinent, ale neměl jsem chuť vrhat své lidi do války s nepříliš jistým výsledkem. Naše komunita je ze všech přítomných podél pobřeží tohoto kontinentu nejmenší.

source: If we help you to reconquer the island, are you willing to go up the river, say once or twice a year, to bring amber to Amoran? You can do it without using boats, and therefore you will not violate the treaties with the orcs, and since your path is the river itself, Wesnoth will not have to bear the burden of rebuilding the road; the ogres will guarantee the security of some landing points between here and Amoran.
cs: Pokud vám pomůžeme znovu dobýt ostrov, jste ochotni vyplavat po řece, řekněme jednou nebo dvakrát do roka, a přinést jantar do Amoranu? Můžete to udělat bez použití člunů, a proto neporušíte smlouvy se skřety. A protože vaší cestou je samotná řeka, Wesnoth nebude muset nést břemeno přestavby silnice. Obři zaručí bezpečnost některých přistávacích bodů mezi tímto místem a Amoranem.

source: Of course, you are breaking through an open door. It was Wesnoth who stopped being interested in amber, decades ago, but it has been always a good business for us to sell the amber to the people of the west!
cs: Samozřejmě, nemusíte se prolamovat do otevřených dveří! Byl to Wesnoth, kdo se před desítkami let přestal o jantar zajímat. Ale pro nás byl prodej jantaru lidem na západě vždy dobrým obchodem!

source: Then, there is only one thing left to do!
cs: Pak už zbývá udělat jen jednu věc!

source: To squash lizards, Oh Oh Oh! Even Glubtrub understand!
cs: Rozmačkat ještěrky, hó, hó, hó! Dokonce i Glubtrub pochopit!

source: Finally, a bit of exercise for my axe!
cs: Konečně nějaká rozcvička pro mou sekeru!

source: Fisssh and mammalsss together, to take our treasssure, I bet! The only metal that they will have will be the iron of our ssspearsss!
cs: Vssadím ssse, žže sssi ryboušši a sssavci chtějí sspoleččně ssáhnout na nášš poklad! Jediný kov, ss kterým ssse sseznámí, budou ššpiččky naššich ošštěpů!

source: Look to north, friends, those big green snakes are poisonous!
cs: Podívejte k severu, přátelé, ti velcí zelení hadi jsou jedovatí!

source: And the thing that is big but gray, is poisonous too?
cs: A ta věc, co je velká, ale šedá, ta je také jedovatá?

source: No, those gray ones don't need to use poison!
cs: Ne, ten šedý tvor nepotřebuje používat jed!

source: Understood! Guys, pay attention to all three of the big snakes; they are much worse than the nagas!
cs: Rozumím! Chlapi, věnujte pozornost těm třem velkým hadům. Jsou mnohem nebezpečnější než nágy!

source: Finally we won, and finally we can go back to Amoran!
cs: Konečně jsme zvítězili a konečně se můžeme vrátit do Amoranu!

source: Not before having properly celebrated this victory! Your help has spared much grief to my people, and we must show you our gratitude for this; we also need to develop details on amber shipments, which could start this autumn.
cs: Ne dříve, než toto vítězství náležitě oslavíme! Vaše pomoc ušetřila mému lidu mnoho zármutku a my vám za to musíme projevit naši vděčnost. Musíme také dojednat podrobnosti o zásilkách jantaru, které by mohly začít letos na podzim.

source: With great pleasure, and not only mine, right Glubtrub?
cs: S velkým potěšením a nejen s mým, viď Glubtrube?

source: Very much true! Stop to work with arms! Now to work with belly! Oh! Oh! Oh!
cs: Hodně pravda! Přestat pracovat zbraněmi! Nyní břicho mít práce! Hó! Hó! Hó!

source: What happened here? Where did all those orcs come from?
cs: Co se tu stalo? Odkud se všichni ti skřeti vzali?

source: One moment, I know those blue and yellow banners! That's the Gan-Tarkas tribe! In Weldyn that name is well known! He is one of the most powerful and authoritative warlords, and although he's officially part of the Northern Alliance, he has never given up his claim on these border lands, including those we have crossed to reach the Nereids. If he has come here, he must have a specific purpose, and I don't think that it's to make a holiday.
cs: Okamžik, já znám ty modré a žluté standarty! To je kmen Gan-Tarkase! Ve Weldynu je jeho jméno dobře známé! Je jedním z nejmocnějších a nejautoritativnějších válečných vůdců. A přestože je oficiálně součástí Severní aliance, nikdy se nevzdal svých nároků na tyto pohraniční země, včetně těch, které jsme překročili, abychom dosáhli zátoky nereid. Pokud sem přišel, musí mít konkrétní záměr a nemyslím si, že je jím užívání si volného času.

source: But if he had warlike intent, why didn't he take advantage of our absence to put such an intent into practice? He has a huge army with him and he would have won easily.
cs: Ale pokud měl válečný záměr, proč nevyužil naší nepřítomnosti k tomu, aby ho uskutečnil? Má s sebou obrovskou armádu a snadno by vyhrál.

source: If that's the case, with the army he seems to have, he could easily win even now. Gan-Tarkas is not the usual tribe-head... and maybe I understand! He can cross the river only at the ford, where few can easily fight against many! A victory won at a high price against an army of peasants would not have helped much to his prestige as a warlord.
cs: Pokud je to tak, tak s armádou, kterou podle všeho má, by klidně mohl vyhrát i teď. Gan-Tarkas není běžný kmenový vůdce... a možná to chápu! Řeku může překročit pouze u brodu, kde se málo může snadno postavit proti mnoha! Vítězství vyhrané za vysokou cenu proti armádě rolníků by mu v jeho válečné prestiži příliš nepomohlo.

source: Let's try to talk to him, and hear what he wants.
cs: Zkusme s ním promluvit a vyslechnout si, co chce.

source: I'm the grand marshal Glauco, military commander of the city of Amoran! I ask to speak with the warlord called Gan-Tarkas.
cs: Jsem velký maršál Glauko, vojenský velitel města Amoran! Žádám o rozhovor s vojevůdcem jménem Gan-Tarkas.

source: I'm the general Glauco, military commander of the city of Amoran! I ask to speak with the warlord called Gan-Tarkas.
cs: Jsem generál Glauko, vojenský velitel města Amoran! Žádám o rozhovor s vojevůdcem jménem Gan-Tarkas.

source: I'm the lieutenant Glauco, military commander of the city of Amoran! I ask to speak with the warlord called Gan-Tarkas.
cs: Jsem poručík Glauko, vojenský velitel města Amoran! Žádám o rozhovor s vojevůdcem jménem Gan-Tarkas.

source: I'm the sergeant Glauco, military commander of the city of Amoran! I ask to speak with the warlord called Gan-Tarkas.
cs: Jsem seržant Glauko, vojenský velitel města Amoran! Žádám o rozhovor s vojevůdcem jménem Gan-Tarkas.

source: What an honor, commander Glauco! Your fame as an exterminator of snakes precedes you, and, as somebody tells to me, also your fame as an exterminator of lizards. <span size='small'>(I'm not including that over-swollen goblin Grunto in that list; he was so weak and stupid, a disgrace to his race.)</span> In what way can I reply to such an honor?
cs: Jaká čest, veliteli Glauko! Předchází tě sláva hubitele hadů, a jak někdo říká, i sláva hubitele ještěrů. <span size='small'>(Nezahrnuji do tohoto seznamu toho otylého Grunta, protože byl tak slabý a hloupý, ostuda své rasy.)</span> Čemu vděčím za takovou poctu?

source: Well, your fame, Gan-Tarkas, is much older than mine, and it's such that it makes me wonder what may have brought such a warlord down here.
cs: Popravdě, tvá sláva, Gan-Tarkasi, je mnohem zasloužilejší než má, a to taková, že mě nutí přemýšlet, co sem mohlo takového vojevůdce přivést.

source: The answer is easy: Amoran brought me down here. Oh, not that there has ever been anything that deserved my interest in those four falling houses in the last few decades, until someone from Amoran destroyed a tribe of orcs! They were spineless, sure, but they were still orcs.
cs: Odpověď je snadná, přivedl mě sám Amoran. Ach, ne že by v posledních několika desetiletích existovalo něco, co by vzbudilo můj zájem o těch několik chátrajících domů. Dokud někdo z Amoranu nezničil kmen skřetů! Byli bezpáteřní, jistě, ale stále to byli skřeti.

source: We had the right to do what we did! Grunto attacked us first, and without any provocation on our part.
cs: Měli jsme právo udělat to, co jsme udělali! Grunto na nás zaútočil jako první, bez jakékoli provokace z naší strany!

source: Of course he did it. Ah! Ah! Ah! I ordered him to do it! And now you should open your ears very well, little man, because my words could be the last you hear in your life!
cs: Samozřejmě, že to udělal. Ha! Ha! Ha! Přikázal jsem mu to udělat! A teď bys měl pořádně otevřít uši, človíčku, protože moje slova mohou být poslední, co ve svém životě uslyšíš!

source: I'm not interested in Amoran, I'm interested in the whole eastern territory, from here to the coast! But I can't take it until Wesnoth thinks that there's something worth being protected here; so I told Grunto to destroy Amoran, then I would have arrived, slowly, and I would have settled here saying that there was no Wesnothian banner here anyway.
cs: Nezajímá mě Amoran, zajímá mě celé východní území, odsud až po pobřeží! Ale nemohu si ho vzít, dokud si Wesnoth myslí, že je tu něco, co stojí za to být chráněno. Tak jsem řekl Gruntovi, aby zničil Amoran. Pak bych dorazil a beze spěchu bych se tady usadil s tím, že tady stejně není žádná wesnothská država.

source: But you put the sticks between my wheels twice, first when you defeated Grunto and his human ally Dadoc, and then you started to go to the east.
cs: Ale dvakrát jsi mi vrazil klacek mezi kola. Nejdřív, když jsi porazil Grunta a jeho lidského spojence Dadoka, a pak, když ses vydal na východ.

source: I immediately understood that you were going there for the amber, and for that reason I waited for you here; I'm sorry, but you and all your friends will have to die, here and today, and Wesnoth will never know anything about the amber and the possibility to resume its trade!
cs: Hned jsem pochopil, že tam jdeš pro jantar, a proto jsem tu na tebe vyčkal. Je mi líto, ale ty a všichni tví přátelé, všichni budete muset zemřít, tady a teď. A Wesnoth se nikdy nedozví nic o jantaru a možnosti obnovit obchod s ním!

source: I know well they will be angry for the destruction of Amoran, but I'll retire immediately, I will make an act of contrition, I will say that I wanted to avenge Grunto and I'll indemnify Wesnoth with a little bit of gold. But in the meantime there will be nothing here, in the west, that Wesnoth may be interested to defend; and with the time I'll return, stealthily, to take all these territories, and my tribe will become the most powerful tribe of orcs on the whole continent!
cs: Dobře vím, že se budou zlobit za zničení Amoranu. Ale okamžitě se stáhnu, budu se tvářit kajícně, řeknu, že jsem chtěl pomstít Grunta a odškodním Wesnoth trochou zlata. Ale mezitím tady na západě nebude nic, co by Wesnoth mohl mít zájem bránit. Časem se pokradmu vrátím, abych obsadil všechna tato území a můj kmen se stane nejmocnějším kmenem skřetů na celém kontinentu!

source: But I'll put my stick between your wheels for the third time, you damned orc, because I won't allow you to cross the ford and destroy my town!
cs: Ale já ti vrazím klacek mezi kola i potřetí, ty zatracený skřete, protože ti nedovolím přejít brod a zničit mé město!

source: Ah! Ah! Ah! Foul human! You really think that the great Gan-Tarkas needs your ford to overpass a river? I've been preparing myself for months, and now I'm ready! Goodbye, little man, you've been good, but not enough to face me! Ah! Ah! Ah!
cs: Ha! Ha! Ha! Hloupý člověče! Opravdu si myslíš, že velký Gan-Tarkas potřebuje tvůj brod, aby překonal řeku? Připravoval jsem se měsíce a teď jsem připraven! Sbohem, člověče, byl jsi dobrý, ale ne dost, abys mi mohl čelit! Ha! Ha! Ha!

source: Let's get some extra fortifications set up, men!
cs: Pojďme postavit další opevnění, muži!

source: Look! He prepared some boats loaded with boulders to sink into the river to create a passage! It must have taken months to plan and prepare this battle; a plan worthy of his fame! And it's worthy of the duplicity of the orcs to demand that Wesnoth respect the pacts on the fluvial navigation, while they were already willing to elude them at the first opportunity!
cs: Podívej! Připravil několik člunů naložených balvany, které potopili do řeky a vytvořili tak brod! Plánování a příprava této bitvy musely trvat měsíce. Plánování hodné jeho slávy! A je také hodné neupřímnosti skřetů požadovat, aby Wesnoth respektoval smlouvy o říční plavbě, když je oni byli schopni při první příležitosti nedodržet!

source: And we will be just as worthy, but with our value and our weapons! Men and ogre, let us show the great Gan-Tarkas that this time he did his accounts poorly!
cs: A my budeme stejně hodní, ale s našimi ideály a našimi zbraněmi! Muži a obře, ukažme skvělému Gan-Tarkasovi, jak se tentokrát přepočítal!

source: Wait! Big problem! Glubtrub to know not to make accounts!
cs: Počkat! Velký problém! Glubtrub nevědět, jak počítat!

source: No problem, my friend! You simply have to squash more orcs that you can see! Today we count so!
cs: Žádný problém příteli! Jednoduše musíš rozmačkat víc skřetů, než vidíš! Takhle dnes počítáme!

source: Yes... big nice... Glubtrub great accounter of squash!
cs: Jo... Hodně pěkný... Glubtrub být skvělý v počítání mačkání!

source: Beware! They are doing the same thing on the other side!
cs: Pozor! Dělají to samé na druhé straně!

source: So he forced us to divide our forces; he's really giving us a tactical lesson; let him see that we learn quickly!
cs: Takže nás donutil rozdělit síly. Opravdu nám dává taktickou lekci. Tak ať vidí, že se rychle učíme!

source: Here I am, Gan-Tarkass, I came to help you, asss I promisssed, to avenge my brother Ksshiss, killed by thisss mammalsss! And I alssso put my gold at your disposssal!
cs: Tady jssem, Gan-Tarkasssi. Přiššel jssem ti pomocct, jak jssem sslíbil, pomsstít ssvého bratra Ksshisse, zabitého tímhletím ssavcem! A taky jssem ti dal k disspozzici sssvé zzlato!

source: I assure you that I'll make a good use of it, and your brother will be avenged!
cs: Ujišťuju tě, že toho dobře využiju a tvůj bratr bude pomstěn!

source: There's woe coming to us from the river, commander!
cs: Od řeky přichází další problémy, veliteli.

source: I saw them! But we can only fight against them; at least it will be an opportunity to get rid of the Nagas once and for all!
cs: Vím o nich! Ale jediné, co můžeme dělat, je s nimi bojovat. Alespoň to bude příležitost zbavit se nág jednou provždy!

source: Here's to hoping it isn't the opportunity for the nagas to get rid of us!
cs: Doufám, že to nebude příležitost pro nágy, aby se zbavily nás!

source: Welcome to Amoran, the last Wesnothian town to the east
cs: Vítejte v Amoranu, posledním wesnothském městě na východě

source: Dawn
cs: Svítání

source: Early Morning
cs: Brzké dopoledne

source: Late Morning
cs: Pozdní dopoledne

source: Midday
cs: Poledne

source: Early Afternoon
cs: Brzké odpoledne

source: Late Afternoon
cs: Pozdní odpoledne

source: Dusk
cs: Soumrak

source: First Watch
cs: První hlídka

source: Second Watch
cs: Druhá hlídka

source: Midnight
cs: Půlnoc

source: Third Watch
cs: Třetí hlídka

source: Fourth Watch
cs: Čtvrtá hlídka

source: This unit is able to stun its enemies, disrupting their zones of control.
cs: Tato jednotka je schopna omračovat své nepřátele a rušit tak jejich zóny kontroly.

source: stun
cs: omráčení

source: This attack hits so hard that the opponent is dazed and can no longer enforce a zone of control. The effect wears off on the opponent’s next turn.
cs: Tento útok je tak drtivý, že je zasažená jednotka omráčena a není schopna dále zajištovat svou zónu kontroly. Tento efekt pomine na začátku dalšího kola zasažené jednotky.
