Repository: hrubymar10/wesnoth-cs
Catalog: add-ons/wesnoth-ala.po
Languages: cs

source: ...commander? Well, technically I'm only a sergeant, but since you're only a cavalryman, I guess I still outrank you... Anyways, that's Sergeant Glauco to you, cavalryman, and I hope to be worthy of your confidence! And now let's rid out this rabble!
cs: ...veliteli? Technicky vzato jsem jen seržant, ale protože jsi jen kavalerista, myslím, že tě pořád převyšuji... Každopádně, jsem pro tebe seržant Glauko, kavaleristo! Doufám, že budu hoden tvé důvěry! A teď, vyžeňme tu chátru!

source: Good morning, men of Wesnoth, let's try to catch the great Dadoc in his home, if you can!
cs: Zdravím, wesnothští muži! Zkuste chytit velkého Dadoka v jeho domovině, pokud to zvládnete!

source: And he even annoys us, that damned bandit! But now what do we do? We know absolutely nothing about this forest, and I won't lead my men into a trap.
cs: A dokonce nás provokuje, ten zatracený bandita! Ale co teď budeme dělat? O tomto lese nevíme absolutně nic a já své muže nepovedu do pasti.

source: Look, sir! There's a cottage over there! I'll go to see if someone lives in it! Whether he be friend or foe, he will tell us something about this place, with good manners in the first case, and with bad ones in the second.
cs: Podívejte, pane! Támhle je chata! Půjdu se podívat, jestli v ní někdo bydlí! Ať už je to přítel, nebo nepřítel, řekne nám něco o tomto místě, buď po dobrém, nebo po zlém.

source: There's no one here? I'm a representative of the Wesnothian Army!
cs: Je tu vůbec někdo? Jsem zástupcem wesnothské armády!

source: There's me, here, representative of Wesnoth's busybodies! Me and my friend Ranfy. And this may also be territory of Wesnoth, but punch me if it isn't the first time I've seen its colors in at least... forty years! What are you doing here right now?
cs: Jsem tu já, zástupče wesnothských velmi zaneprázdněných úřadů! Já a můj přítel Ranfy. A může být, že tohle je území Wesnothu. Ale i kdyby mi někdo jednu ubalil, nevzpomenu si, jestli jsem tu vůbec kdy viděl někoho pod wesnothskou vlajkou. Možná před... čtyřiceti lety? Tak co tady právě teď děláte?

source: I'm the sergeant Glauco, commander of the Amoran's garrison! My companions and I are searching for Dadoc the bandit, because we need to give him what he deserves! But who is Ranfy?
cs: Jsem seržant Glauko, velitel posádky Amoranu! Já a moji společníci hledáme Dadoka, banditu, protože mu musíme dát, co si zaslouží! Ale kdo je Ranfy?

source: Kreeeeee!
cs: Kráááááá!

source: Watch out! A monster!
cs: Pozor! Obluda!

source: The only “monstrous” thing here, Wesnothians, is your ignorance! He's Ranfy; I adopted him when he was still an egg! Since then he's been helping me to hunt and to keep mice and bandits away from our home, bandits like your friend Dadoc, who, I fear, you'll have to look for in the forest. Well, good luck, because you'll need a lot of it!
cs: Jediná „obludná“ věc, wesnoťané, je vaše ignorance! To je Ranfy. Adoptoval jsem ho, když byl ještě vajíčkem! Od té doby mi pomáhá lovit a držet myši a bandity daleko od našeho domova. Bandity jako tvůj přítel Dadok, kterého, jak se obávám, budeš muset hledat v lese. No, hodně štěstí, protože toho budete potřebovat moc!

source: You seem to know this place well, why don't you help us? Eliminating Dadoc will save a little bit of work for your... nice friend.
cs: Zdá se, že toto místo dobře znáš, proč nám nepomůžeš? Eliminací Dadoka ušetříš trochu práce svému... milému kamarádovi.

source: Guy, no human being knows the wilderness from here to the sea better than Divaid, who would be me, and I believe that I will help you westerners, since you have been kind to Ranfy!
cs: Chlape, žádná lidská bytost nezná divočinu odsud až k moři lépe než já, Divaid. A začínám být přesvědčen, že vám, zápaďákům, pomůžu, protože jste byli laskaví k Ranfymu!

source: After we bring Dadoc to justice, we'll go east to meet the nereids; could you come with us as a guide? I have a desperate need for someone who knows the wildlands, and I'll pay well.
cs: Až odevzdáme Dadoka soudu, půjdeme na východ, abychom se setkali s nereidami. Mohl bys jít s námi jako průvodce? Zoufale potřebuji někoho, kdo zná divočinu, a dobře zaplatím.

source: To the coast? Well I'll be damned, it's been awhile since I last saw the sea, and Ranfy has <i>never</i> seen it... it might be a good opportunity to show him the sea... what do you say Ranfy, shall we give a hand to these yahoos from the town?
cs: Na pobřeží? No, ať se propadnu, je už to nějaký čas, co jsem naposledy viděl moře, a Ranfy ho neviděl <i>nikdy</i>... Možná je to dobrá příležitost mu moře ukázat... Co ty, Ranfy, řekni, pomůžeme těm nabubřelým městským floutkům?

source: Kraaaaaa... Kruu Kruu... Fiiii
cs: Kráááááá... Ráád ráád... Jóóóó

source: You are a lucky man, mister commander of Amoran's garrison! My friend, here, says that he likes you! So, my new companions, things are like this: Dadoc has a certain number of shelters, in the forest, where he disperses his band when they don't have to act. To find Dadoc we will have to rummage through them one by one, and if we are lucky we will find Dadoc immediately; if we have misfortune we will have to explore them all; but we may not have the time to do so.
cs: Jsi šťastný muž, pane veliteli posádky Amoranu! Můj přítel tady říká, že tě má rád! Takže moji noví společníci, věci se mají takto: Dadok má určitý počet úkrytů v lese, kde se porůznu placatí členové jeho bandy, když nemají co na práci. Abychom našli Dadoka, budeme se muset prohrabat jedním úkrytem za druhým. Pokud budeme mít štěstí, najdeme Dadoka okamžitě, a pokud ne, budeme je muset prozkoumat všechny. Ale na to možná nemáme čas.

source: Why?
cs: Proč?

source: Because Dadoc will escape when he sees his henchmen fail to stop us in a short time; he's a very cautious guy. We have to find him quickly, otherwise we can also say him good-bye forever.
cs: Protože Dadok uteče, když uvidí, že nás jeho souputníci v krátké době nezastaví. Je to velmi opatrný chlap. Musíme ho rychle najít, jinak se s ním také můžeme navždy rozloučit.

source: Then let's not waste any more time! Come on, men! We can't let that rascal's wrongdoings remain unpunished!
cs: Pak už neztrácejme čas! Pojďte, muži! Nemůžeme dovolit, aby prohřešky toho darebáka zůstaly nepotrestány!

source: Commander, it seems we managed to get here without being sighted by the orcs, but from here to the orc fortress, the plain does not offer any protection or hiding places; we have to attack from here.
cs: Veliteli, zdá se, že se nám sem podařilo dostat, aniž nás skřeti spatřili. Ale odtud až do skřetí pevnosti nenabízí planina žádnou ochranu ani úkryt. Musíme zaútočit z tohoto místa.

source: You've got that right, Geobard, this plain is completely bare; but look to the forest to our right! Organize a corvee that takes logs from it to build a fence here.
cs: Máš pravdu, Geobarde, tahle pláň je úplně holá. Ale podívej se na ten les napravo od nás! Uspořádej pracovní četu, která tam bude těžit klády, aby tu z nich postavila valy.

source: But we'll lose almost half a day, and we will allow the orcs to organize and attack us.
cs: Ale tím ztratíme téměř půl dne a umožníme skřetům, aby se zorganizovali a napadli nás.

source: If we use all our men, we'll manage to have a place to defend ourselves during the night; in any case we would not be able to get close to the orcish camp before twilight anyways. It's better to have something on which to break their initial wave.
cs: Pokud použijeme všechny naše muže, podaří se nám mít přes noc místo, kde se lze bránit. V každém případě bychom se stejně nebyli schopni dostat do blízkosti skřetího tábora před soumrakem. Je lepší mít něco, na čem zlomíme jejich počáteční nápor.

source: I hope you're right, commander, because as long as the men are busy building the fence they can't do anything else! Better get to work right away, then! I will also erect tents in which to treat the wounded.
cs: Doufám, že máš pravdu veliteli, protože dokud jsou muži zaneprázdněni stavbou valů, nemohou dělat nic jiného! Takže se raději hned pusťme do práce! Vztyčíme také stany, ve kterých se budou ošetřovat ranění.

source: What are those humans doing there?
cs: Co tu dělaj ty lidi?

source: It seems they are building fences, boss!
cs: Zdá se, že staví valy, šéfe!

source: I didn't mean that, you idiot! I wanted to say: why you haven't yet slaughtered them?
cs: Tak jsem to nemyslel, ty idiote! Chtěl jsem říct: „Proč jste je ještě nezabili?“

source: Gulp... We'll do it immediately, chief, the time to gather the boys!
cs: (<i>Polk...</i>) Hned jdem na to, šéfe! Všichni shromáždit!

source: Just in time, men; here they come! Let your heart be no less firm than the palisade that your arms have built!
cs: Právě včas, muži! Už přicházejí! Ať jsou vaše srdce stejně pevná jako palisády, co vybudovaly vaše paže!

source: Sir, the men who have been in the forest have glimpsed a house in the trees. It'd be a good idea to check if it is inhabited by friends or by enemies, since we have it behind us.
cs: Pane, muži, kteří byli v lese, zahlédli mezi stromy dům. Bylo by dobré zkontrolovat, zda je obýván přáteli nebo nepřáteli, protože je za naší linií.

source: A cottage right in the middle of the orcish territory? Who can live here?
cs: Chata přímo uprostřed skřetího území? Kdo tu může žít?

source: This is my home, busybody, mine and Fangy's, of course! You, on the other hand... what business does a soldier of Wesnoth have in the territory of that orcish thief, Grunto?
cs: Tohle je můj domov, pane důležitý, můj a Fangy, samozřejmě! Na druhou stranu ty... co za prácičku má voják z Wesnothu na území toho skřetího zloděje Grunta?

source: That orc attacked Amoran some days ago, and we have come to even the accounts! But who is Fangy?
cs: Ten skřet před několika dny zaútočil na Amoran a my jsme přišli vyrovnat účty! Ale kdo je Fangy?

source: Beware, men! A fierce beast!
cs: Pozor, muži, na to divoké zvíře!

source: Here, the only beasts are you, Wesnothians! She is Fangy, my little home lady. She keeps rats and orcs away from our beautiful forest. Bah! Since you came here to make the party at Grunto, I'll have to help you. I haven't forgiven him for stealing Fangy's last litter, to have mounts for his Goblins. And then, since westerners from the city like you can't know much about these lands, I'm afraid you'll need someone who knows them better than you!
cs: Hej, jediní, kdo se tu chová jako zvěř, jste vy, wesnoťani! Tohle je Fangy, moje malá domácí fenka. Drží krysy a skřety daleko od našeho krásného lesa. Hm, ach! Protože jste se sem přišli vypořádat s Gruntem, budu vám muset pomoct. Furt mě žere, jak ukradl Fangy její poslední vrh, aby měl jezdecká zvířata pro svoje gobliny. A protože zápaďáci z města jako vy toho o těchhle zemích moc vědět nemůžou, obávám se, že budete potřebovat někoho, kdo je zná líp než vy!

source: All help will be well accepted, both yours and that of the beas... that of the beautiful lady.
cs: Veškerá pomoc bude vítána, jak tvoje, tak té bes... té milé fenky.

source: Have you listened, my dear? This Wesnothian lout is not so loutish, finally! Come on then, it will be fun!
cs: Slyšelas, miláčku? Tenhle wesnothský klacek nakonec není takový hrubián! Tak pojďte, bude sranda!

source: Grauur... Grr... woof!
cs: Grrrrr... Grr... vaf!

source: You can say it strong, my dear!
cs: Můžeš to říct pořádně nahlas, drahá!

source: What's the situation?
cs: Jaká je situace?

source: I would say it's bad, but I'm afraid it's awful. The old caravan station was partially swallowed up by the river, and it seems that a group of Nagas have nestled there.
cs: Rád bych řekl, že je špatná, ale obávám se, že je spíš hrozná. Starou stanici pro karavany částečně pohltila řeka a zdá se, že se tam usídlila skupina nág.

source: Also, on the hills just to the south, there are small buildings, and from the stench that comes out I would say they are Ogre huts.
cs: A na kopcích na jihu jsou malé budovy a podle toho smradu, co z nich vychází, bych řekl, že jsou to chatrče obrů.

source: We could bypass them, but my project for the new Amber Path requires the river to be free! Mmmh... Rather, isn't it strange that Ogres are allies with Nagas? I know little about both the races, it's true, but a little bird told me that the Nagas are allied only with the reptiles and offer them precious metals in exchange for their help, and this excludes the ogres, who never possess precious objects.
cs: Mohli bychom je obejít, ale můj projekt nové Jantarové stezky vyžaduje, aby byla řeka volná! Hmmm... A není to takové divné, že jsou obři spojenci nág? O obou rasách toho vím málo, to je pravda, ale ptáčkové mi štěbetali, že nágy se spojují pouze s ještěry. Nabízejí jim vzácné kovy výměnou za jejich pomoc. Což vylučuje obry, kteří drahocenné předměty nikdy nevlastní.

source: And who said they were allies? Isn't it said that the dove is nestling near the falcon's nest? I know well all the beings living in the wilderness of the east, and I can assure you that an Ogre would only invite a Naga to dinner to make it their first course. If they live so close it must be such a case; probably the Nagas have arrived going up the river and have found the ogres here; because they occupy different spaces they have not given too much discomfort to each other.
cs: A kdo řekl, že jsou spojenci? Neříká se, že holubice hnízdí u sokolího hnízda? Znám dobře všechny bytosti žijící ve východní divočině a mohu tě ujistit, že obr by přizval nágu na večeři pouze ve formě prvního chodu. Pokud žijí tak blízko, musí to být takový případ. Nágy sem pravděpodobně přišly z oblasti níže po toku řeky a narazily zde na obry. Protože ale obývají různé prostory, příliš si nevadí.

source: So is it possible that we should face only the Nagas?
cs: Takže je možné, že bychom měli čelit pouze nágám?

source: Ogres will not move a finger to help the Nagas, on this I will bet my last arrow, but I can not rule out that they'll think of taking advantage of our battle with the Nagas to take out both sides, or that they will attack us after we have defeated the nagas, though... it would be a plan too complicated for their brains.
cs: Obři nehnou ani prstem, aby pomohli nágám, na to vsadím svůj poslední šíp. Ale nemůžu vyloučit, že je napadne využít našeho vzájemného boje aby zneškodnili obě strany, nebo že na nás zaútočí poté, co porazíme nágy. I když..., to by byl plán pro jejich mozkovny příliš komplikovaný.

source: We'll have to take the risk. Get ready, men, it will be a tough fight!
cs: Budeme muset zariskovat. Připravme se, muži, bude to těžký boj!

source: Humansss? After all thisss time they wantsss to reconquessst this place? They'll find only their deathsss!
cs: Lidsský? Po vššem tom ččassse chtějí zznovu obssadit tohle míssto? Najdou jen sssvou ssmrt!

source: Ssstupid lard mammal, ssstay out of thisss ssstory or you won't be able to get out!
cs: Sstupidní ssavčí ssádelňácci, držžte ssse mimo tuhle zzáležžitosst, nebo ssse z ní nevyssoukáte ven!

source: Wait, ogre, we didn't come here to fight with you, but only to fight the nagas occupying our ancient station!
cs: Počkej, obře, nepřišli jsme sem bojovat s vámi, ale jen s těmi nágami okupujícími naši prastarou stanici!

source: Glubtrub to hate snake! Little fat to eat and bad! They to kill our puppies when they to play near ruins! But soldier with colors of Wetspot never to be friends ogres... I believe... I don't remember well!
cs: Glubtrub nemít rád hady! Málo tuku k jídlu, a ne moc dobré! Chtít zabít naše malé, když si hrát poblíž ruin! Ale voják vesnutích barev nikdy nebýt přítel obrů... Já věřit... Nepamatovat si moc!

source: Well, I promise you that Wesnoth's soldiers will not fight against the ogres of the Glubtrub tribe if you help us to defeat the Nagas; in fact, now I have to go east for a mission that, if successful, could allow me to grant these lands to ogres!
cs: No, slibuji vám, že vojáci Wesnothu nebudou bojovat proti obrům z Glubtrubova kmene, pokud nám pomůžete porazit nágy. Dokonce teď mířím na východ kvůli misi, která mi v případě úspěchu umožní udělit tyto země obrům!

source: Understand little, but... meanwhile to squash snakes, to understand well after!
cs: Rozumět málo, ale... teď hady mačkat, dobře rozumět potom!

source: (<i>To Glauco</i>) I don't understand! Weren't we supposed to free the amber way? With the ogres settled here, how are we going to do this?
cs: (<i>Mluví ke Glaukovi:</i>) Nechápu, neměli jsme uvolnit Jantarovou stezku? Jak to uděláme, když tu budou usazení obři?

source: If the ogre tribe becomes our allies, not only will they not be an obstacle, but they will even be a benefit, because they'll protect this territory from invaders like the Naga; for the completion of my project, meanwhile, it's essential to liberate the river.
cs: Pokud se kmen obrů stane naším spojencem, nejen že nebude překážkou, ale bude dokonce přínosem, protože ochrání toto území před vetřelci, jako jsou nágy. Pro dokončení mého projektu je mezitím nezbytné osvobodit řeku.

source: You have led us well, and I'll trust you even now, also because the help of Ogres, today, is necessary! In that nest there are more Naga than we expected, and they are also experts as well as armed!
cs: Vedl jsi nás dobře a já ti budu věřit i dál. I proto, že pomoc obrů je dnes nezbytná! V tomhle doupěti je víc nág, než jsme čekali, a jsou to zkušení a dobře ozbrojení protivníci!

source: The station is free, and the river, too! Good work, my soldiers!
cs: Stanice je volná a řeka také! Dobrá práce, mí vojáci!

source: Nice! Snakes make flat like sole into the river, flat-flat! You like me, man of Wetspot! I to come with you, and together to come to squash world!
cs: Pěkný! Hadi pleskat o zem, jak když šlápnout do řeka, ležet tuhý jak kláda! My mít se rádi s muž z Vesnutu! Jít s vámi, spolu jít a mačkat svět!

source: Err... yes, you are like me, too, very much, Glubtrub, but I don't go around... to squash; I'm on a mission with a specific purpose... in general, we only fight the enemies of Wesnoth!
cs: Err... jasně, také se mi líbíš, Glubtrube. Ale já se nechystám... něco mačkat. Jsem na misi s konkrétním účelem... Obecně, my bojujeme pouze s nepřáteli Wesnothu!

source: More better! To like more to eat and to sleep than to fight! But... how to be enemies of Wetspot? Be edible?
cs: Ještě lepší! Mít rád více jíst a spát než bojovat! Ale... jak to být s nepříteli Vesnutu? Být k jídlu?

source: So... therefore... not usually... I believe. However, the enemies of Wetspot... er Wesnoth, would be those who live in the territory of Wesnoth and don't respect its laws, or those who want to take possession of the goods or of the life of the inhabitants of Wesnoth.
cs: Nu... tedy... obvykle ne... předpokládám. Nicméně, nepřáteli Vesnutu... eh Wesnothu by mohli být ti, kteří žijí na území Wesnothu a nerespektují jeho zákony, nebo ti, kteří se chtějí zmocnit zboží nebo života obyvatel Wesnothu.

source: ...to understand... nothing! But more better so, I not used to understand things, OH OH OH! We to do so, you to say me who is enemy of Wetspot, and I to squash him!
cs: ... chápat... nic nechápat! Ale to být dobře, nezvyknout věcem rozumět, hó hó hó! Abychom to udělat dobře, ty řeknout mi, kdo nepřítel Vesnutu, a já rozmáčknout!

source: Beh, I suppose that can be acceptable in this way! Glad to have you with us, Glubtrub, your strength will be useful to us!
cs: Nu, připouštím, že to takto může být přijatelné. Jsme rádi, že jsi s námi, Glubtrube, tvoje síla se nám bude hodit!

source: Well, gentlemen, since you don't want to spend a few weeks climbing the mountains further south (which I think is a good idea since the wilds become even more wild in those mountains), we have just to find a road that leads us on the other side of this territorry, through the bloody hills.
cs: Takže, pánové, protože nechcete strávit pár týdnů lezením po horách, co jsou dále na jihu (což je podle mě dobrý nápad, protože divočina je tam ještě divočejší), musíme najít cestu, která nás dovede na druhou stranu tohoto území, a to přes Krvavé kopce.

source: What's the problem? The season is good, the weather is beautiful, and these hills were safe when the amber caravans passed through them!
cs: A co je za problém? Roční doba je příznivá, počasí krásné a ty kopce byly bezpečné, když jimi projížděly karavany s jantarem!

source: Too bad that those times are over before you were born, commander! In the past the road was quiet because the few remaining dwarves lived in the mines that they exploited for centuries; these mines have been exhausted for a while, but some dwarves still extracted something that allowed them to trade with the caravan workers; when the caravans ceased, the dwarves raised their heels and left!
cs: Škoda, že ty časy skončily dříve, než jste se narodil, veliteli! V minulosti byla cesta klidná, protože těch pár zbývajících trpaslíků žilo v dolech, ve kterých těžili po staletí. Ty doly byly už nějakou dobu vyčerpané, ale někteří trpaslíci stále dokázali vytěžit něco, co jim umožnilo obchodovat s karavanami. Když přestaly karavany chodit, zvedli trpaslíci zadky a odešli!

source: Better, so they will not try to charge us any toll!
cs: To je ještě lepší, nebudou se nám snažit účtovat žádné mýtné!

source: Worse, you'll want to say! The abandoned mines have become the wolves' den, including the Dire Wolves, and during the day they come out to attack intruders, that is, those like us; and finally, the collapse of some complex of tunnels, no longer maintained by the dwarves, has opened chasms here and there, and those have become the home of bats of all kinds, including the worst types of course!
cs: Chtěl jsi říct horší! Opuštěné doly se staly doupaty vlků, včetně pravlků, a ti během dne vycházejí útočit na vetřelce, tedy takové, jako jsme my. A k tomu ještě zřícení nějakého komplexu tunelů, které již trpaslíci neudržují, sem tam otevřelo propasti, jež se staly domovem netopýrů všech druhů, samozřejmě včetně těch nejhorších!

source: Of course! At least now we know why these place is called the Bloody Hills!
cs: No samozřejmě! Teď alespoň víme, proč se těm místům říká Krvavé kopce!

source: Not at all! The name dates back to centuries ago, when the dwarves began to exploit the iron deposits under the hills; the scraps of their excavations that the dwarves accumulated outside are full of iron dust, and when the wind dispersed those rusty powders all the hills took on a blood tinge, until it rained! Anyway, my proposal is to cross them as fast as possible!
cs: Ale vůbec ne! Jméno pochází z doby před staletími, kdy trpaslíci začali těžit ložiska železa pod kopci. Hlušina, kterou trpaslíci nashromáždili venku, je plná železného prachu, a když vítr rozptýlil ty rezavé prášky, chytly všechny kopce krvavý nádech, dokud neopršely! Každopádně můj návrh je překročit je co nejrychleji!

source: It seems like a great idea to me!
cs: To mi přijde jako výtečný nápad!

source: Glubtrub to think the same!
cs: Glubtrub myslet to samé!

source: Well then! There is a monolith, beyond these hills, that should show us where the old Amber Road takes up again! We just have to get there!
cs: Dobrá tedy! Za těmito kopci je monolit, který by nám měl zase ukázat, kudy se ubírá stará Jantarová stezka! Prostě se tam musíme dostat!

source: By my grandfather's beard! Some humans, and even... Wesnothian soldiers? What the hell are you doing here?
cs: U dědova fousu! Lidé a dokonce snad... wesnothští vojáci? Co tu ksakru děláte?
