Repository: hrubymar10/wesnoth-cs
Catalog: add-ons/wesnoth-ala.po
Languages: cs

source: A Little Adventure
cs: Malé dobrodružství

source: ALA
cs: MD

source: Sergeant
cs: Seržant

source: Easy
cs: Lehká

source: Lieutenant
cs: Poručík

source: Normal
cs: Normální

source: General
cs: Generál

source: Difficult
cs: Obtížná

source: A young Wesnothian army officer is sent to command a tiny garrison in an insignificant town in the wilds of the far east; unexpectedly he will manage not only the defense of the town, but also its economic rebirth, committing itself to reopening the legendary Amber Road!
cs: Mladý důstojník wesnothské armády je poslán, aby velel malé posádce v bezvýznamném městečku v divočině dálného východu. Nečekaně zvládne nejen obranu města, ale i jeho ekonomické znovuzrození, zavazuje se tak znovuotevřít legendární Jantarovou stezku!

source: (Novice Level, 6 scenarios + 1 epilogue)
cs: (Úroveň nováček, 6 scénářů + epilog.)

source: Campaign Design, prose and story Edits
cs: Návrh kampaně, úpravy prózy a příběhu

source: Campaign Maintenance
cs: Údržba kampaně

source: Great Ogre character design and configuration
cs: Návrh a konfigurace jednotky obrovitého obra

source: She-Ogre portrait
cs: Portrét obryně

source: Special thanks for tips and help
cs: Zvláštní poděkování za nápady a pomoc

source: Italian Translation
cs: Italský překlad

source: Czech Translation
cs: Český překlad

source: Japanese Translation
cs: Japonský překlad

source: The Attack to Amoran
cs: Amoran pod útokem

source: Wesnothians
cs: Wesnoťané

source: Glauco
cs: Glauko

source: Orcs
cs: Skřeti

source: Bandits
cs: Bandité

source: Dadoc
cs: Dadok

source: Defeat one enemy leader
cs: Poraz jednoho z nepřátelských vůdců

source: Death of Glauco
cs: Glauko zemře

source: Which leader you defeat will determine your next scenario.
cs: Tvůj další scénář bude určen tím, kterého vůdce porazíš.

source: The Ford of Amoran
cs: Amoranský brod

source: The Estdoor bridge
cs: most Východní brány

source: Death of Geobard
cs: Geobard zemře

source: Both orcs and bandits have fled! Looks like we won this battle!
cs: Skřeti i bandité uprchli! Vypadá to, že jsme tuto bitvu vyhráli!

source: Not bad, but not enough!
cs: To není špatné, ale nestačí to.

source: Yikes, they're closing in on that Grunto! The plan won't work without him; I'd better start planning my escape, in case he's unable to fulfill his half of the pact...
cs: Ale fuj, už se skoro dostali Gruntovi na kobylku! Plán bez něj nebude fungovat. Pro případ, že nebude schopen splnit svou část dohody, bych raději měl začít plánovat svůj útěk...

source: Die, damned orc!
cs: Zemři, proklatý skřete!

source: That stupid orc got himself killed, I'm not going to come to the same end as him. Let's retire, guys, we'll be back on another occasion, with stronger allies!
cs: Ten hloupý skřet si sám přivodil smrt. Nehodlám skončit jako on. Stáhněme se, chlapci, vrátíme se při jiné příležitosti a se silnějšími spojenci!

source: That human we were supposed to work with doesn't look like he'll be able to fulfill his half of the pact! We just might have to leave if he fails us...
cs: Ten člověk, s kterým jsme měli zmáknout tuhle prácičku, nevypadá, že bude schopen splnit svou část dohody! Pokud nás zklame, budem možná muset odejít...

source: The right fate for a wrong man!
cs: Správný osud pro špatného chlapa!

source: Here's what happens to humans who are too weak! Let's go, guys, we have nothing more to do here, for today at least!
cs: A to je to, co se stane lidem, kteří jsou příliš slabí! Jdeme, skřeti, už tu nemáme co dělat, aspoň pro dnešek!

source: After many days of battle, the civilians enlisted, not used to fighting, began to desert, frightened and exhausted! The large voids that opened in the lines of the defenders made those who still insisted on fighting even more vulnerable, and soon it was the end!
cs: Vystrašeni a vyčerpáni po mnoha dnech bitvy začali naverbovaní, boji nezvyklí civilisté dezertovat! Velké mezery, které se otevřely v řadách obránců, učinily ty, kteří stále vytrvali v boji, ještě zranitelnějšími a brzy byl konec!

source: I failed my first command! Better to die here than return to Wesnoth like a loser!
cs: Nesplnil jsem svůj první úkol! Je lepší tu zemřít, než se vrátit do Wesnothu jako poražený!

source: Battle with the Bandits
cs: Bitva s bandity

source: claws
cs: drápy

source: Defeat of Dadoc
cs: Poraz Dadoka

source: Death of Divaid
cs: Divaid zemře

source: End of turns
cs: Vyprší počet kol

source: Kreeee!
cs: Kráááá!

source: Ranfy found somebody!
cs: Ranfy někoho našel!

source: There's someone here!
cs: Někdo tu je!

source: There he is! Don't lose sight of it another time!
cs: Tady je! Neztraťte ho z očí!

source: Find me don't mean catch me!
cs: Najít mě neznamená chytit mě!

source: Kraii?
cs: Kráá?

source: Ranfy found a little bit of gold in that uninhabited house! Probably it was hidden by some bandit.
cs: Ranfy našel v tom neobydleném domě trochu zlata! Nejspíš ho tam skryl nějaký bandita.

source: There's some gold hidden here! Not much, but better than nothing.
cs: Je tu schované nějaké zlato! Ne mnoho, ale lepší než nic.

source: End of run... for me...
cs: Skřípli... mě...

source: Good work, Ranfy!
cs: Dobrá práce, Ranfy!

source: This is the reward for your crimes, you dirty bandit Dadoc, in the name of all the people of this land!
cs: Tohle je odměna za tvoje zločiny, ty špinavý bandito Dadoku, ve jménu všech lidí této země!

source: Amoran is more safe, now! This will give us the time to take care of something else!
cs: Amoran je teď bezpečnější! To nám dá čas věnovat se něčemu jinému!

source: Farewell, men of Wesnoth, Dadoc will remain a free man! AH AH AH!
cs: Sbohem, wesnothští mužové, Dadok zůstane volný jako pták! HA HA HA!

source: Damn, he escaped us. We must return to Amoran as failures!
cs: Sakra, utekl nám. Musíme se vrátit do Amoranu jako poražení!

source: Battle with the Orcs
cs: Bitva se skřety

source: Defeat Grunto
cs: Poraz Grunta

source: Croquet
cs: Kroket

source: fangs
cs: tesáky

source: Death of Croquet
cs: Kroket zemře

source: Aaaaah!
cs: Aáách!

source: Die, orc, for all of Amoran's people!
cs: Zemři, skřete! Ve jménu lidí Amoraku!

source: Damn! This battle is dragging on too long, the men are exhausted! We must retreat, the mission failed!
cs: Sakra! Bitva se vleče příliš dlouho, muži jsou vyčerpaní! Musíme ustoupit, mise se nezdařila!

source: The Naga's Nest
cs: Doupě nág

source: Nagas
cs: Nágy

source: cleaver
cs: sekáček

source: Ogres
cs: Obři

source: Defeat Kssihiss
cs: Poraz Kssihisse

source: Death of $trapper_name
cs: $trapper_name zemře

source: What this confusion? Men colored like Wetspot and snake to fight? Ogres to come too, good chance to squash all!
cs: Co to být za zmatek? Muži s vesnutíma barvama mít velká pračka s hadama? Obři, jít sem taky. Dobrá šance podrtit ty i ty!

source: Death of Glubtrub
cs: Glubtrub zemře

source: Yes! Squash skull of snake! Is time!
cs: Jó! Je čas mačkat hadí lebka!

source: Wesnoth Kingdom - Caravan Station n° 2
cs: království Wesnoth – přepřahací stanice č. 2

source: Damned humansss... Hiss!
cs: Zzatraccený lidsský... Ass!

source: The Bloody Hills
cs: Krvavé kopce

source: Monsters
cs: Monstra

source: Glauco reaches the waypoint (marked by a monolith) over the mountains
cs: Glauko dosáhne místa (označeného monolitem) na druhé straně hor

source: Wesnoth Kingdom - Caravan Station n° 1
cs: království Wesnoth – přepřahací stanice č. 1

source: Damned wolves, I thought I had taught you not to come into my house! Well, I'll make a wrap out of your fur!
cs: Zatracení vlci, myslel jsem, že jsem vás naučil nechodit do mého domu! Dobře, udělám si z tebe předložku!

source: Hey you! Get your hands off my little Fangy!
cs: Hej ty! Ruce pryč od mé malé Fangy!

source: Ugly bird! Wolves and bats were not enough around here? I'll wring your neck like a capon!
cs: Ošklivý pták! Jako by tu nebylo dost vlků a netopýrů! Zakroutím ti krkem jako kapounovi!

source: Don't you dare to touch my friend Ranfy, tattooed midget!
cs: Neopovažuj se dotknout mého přítele Ranfyho, ty potetovanej zakrslíku!

source: Urca! House inhabited!
cs: Hé! Dům obydlený!

source: That's right, stupid ogre! And we were only missing you to complete my home! Well, if I break your head I will not do much damage, as you don't hold anything in there!
cs: Přesně tak, hloupý obře! A jediné, co jsme v mém domově postrádali, byla finální trofej, jako jsi ty! No, když ti rozbiju hlavu, moc škody nenadělám, protože v ní beztak nic nemáš!

source: Wait, that ogre is with us!
cs: Počkat, ten obr je s námi!

source: Hey! There's somebody here!
cs: Hej! Někdo tu je!

source: We passed those hills, finally! We can continue on to reach the nereids now!
cs: Konečně, přešli jsme ty kopce! Můžeme teď pokračovat směrem k nereidám!

source: All these attacks are exhausting us; we won't be able to cross the hills! We must retreat; the mission failed!
cs: Všechny tyhle útoky nás vyčerpávají. Nezvládnem přejít kopce! Musíme ustoupit, mise se nezdařila!

source: The Lizard's Islands
cs: Ještěří ostrovy

source: Giksy
cs: Džiksy

source: Saurian
cs: Ještěráci

source: Nereids
cs: Nereidy

source: Squash... or... Defeat the Saurian Chief
cs: Rozmačkej... nebo poraz ještěráckého vůdce

source: The death of $trapper_name will no longer cause defeat.
cs: Od této chvíle již neprohraješ, pokud $trapper_name zemře.

source: Let's ssshow them the little sssurprissse that we had prepared for the fisssh if they had decided to recover the issland!
cs: Ukažžme jim to malé přřekvapení, cco jsssme přřipravili pro ryboušše, kdyby ssse chtěli zznovu zzmoccnit osstrova!

source: Thingsss are not going well! Ssshamansss, sssummon other sssnakesss from the sssea!
cs: Věccci ssse sstáčejí ššpatně! Ššamané, sssvolejte dalššší mořřsské ssserpenty!

source: More monsters are coming from the north; they're like the ones from before!
cs: Ze severu přicházejí další monstra! Jsou stejná jako ta předchozí!

source: We need of othersss sssea companionsss, sssummon them all!
cs: Potřřebujeme dalšší mořřsské ssspoleččníky, sssvolejte je vššechny!

source: I hope these are the last ones! They make me feel seasick with all their contortions!
cs: Doufám, že tohle jsou poslední! Mám z těch všech vlnitých těl mořskou nemoc!

source: Aaah... I'll... never... sssee... my... treasssure... again...
cs: Aaah... Užžž... nikdy... nezzzřím... zzzasss... sssvůj... poklad...

source: Oh no, without the nereids' help, it was all in vain! I failed!
cs: Ach ne, bez pomoci nereid nemáme šanci! Selhal jsem!

source: It's useless, and we cannot prevail! We failed!
cs: Je to zbytečné, nemůžeme zvítězit! Selhali jsme!

source: The Last Battle
cs: Poslední bitva

source: Defeat Gan-Tarkas
cs: Poraz Gan-Tarkase

source: Widen the path across the river again, and then everyone attack!
cs: Rozšiřte znovu cestu přes řeku a pak všichni zaútočte!

source: Defeat all enemy leaders
cs: Poraz všechny nepřátelské vůdce

source: Those damned are all dead or escaped! Finally we finished!
cs: Ti zatracenci jsou všichni mrtví nebo uprchli! Konečně jsme hotovi!

source: Impossible!
cs: Nemožný!

source: With your end, orc, Amoran can and will have a new start!
cs: S tvým koncem, skřete, může a bude mít Amoran novou budoucnost!

source: To remain only to squash big snake!
cs: Jen velký had zbývat rozmáčknout!

source: Hissss!
cs: Assss!

source: Other snake make flat-flat! Oh! Oh! Oh!
cs: Další had ležet jak kláda! Hó! Hó! Hó!

source: And now let's finish taking care of his friend, Gan-Tarkas!
cs: A teď to pojďme dokončit s jeho kámošem Gan-Tarkasem!

source: Epilogue
cs: Epilog

source: Merman Brawler
cs: Mořský rváč

source: fist
cs: pěst

source: tail
cs: ocas

source: female^stunned
cs: omráčená

source: stunned
cs: omráčený

source: Merman Citizen
cs: Mořský obyvatel

source: City Militia
cs: Městská milice

source: City militia is composed from citizens of Wesnothian towns. Their role is usually just policing the cities and guarding the walls.
cs: Městská milice se skládá z občanů wesnothských měst. Její úlohou je obvykle jen udržovat v městech pořádek a hlídat jejich hradby.

source: spear
cs: kopí

source: Giant Ogre
cs: Obrovitý obr

source: Giant Ogres are creatures that usually live alone in the wilderness, remarkably similar to humans in form, though large and misshapen. While they can be easily outrun or outsmarted, their strength is not to be underestimated.
cs: Obrovití obři jsou veliké bytosti žijící v divočině a většinou samotářsky. Výrazně se podobají lidem, i když nabývají úctyhodných rozměrů a jsou deformovaní. I když jsou nemotorní a docela hloupí, jejich síla se nesmí podceňovat.

source: Matronly Ogre
cs: Obří matróna

source: As they grow older, she-ogres gain weight, so they lose the agility necessary to use slings, but, in exchange, they gain the capability to use bigger and better clubs.
cs: Jak obryně stárnou, přibývají na váze, takže ztrácejí hbitost potřebnou k ovládání praků, ale za to mohou používat větší a lepší kyje.

source: club
cs: kyj

source: Naga Guardian
cs: Nága hlídka

source: These heavy fighters are the elite guards of the naga. They are slower and more heavily armored than most naga and wield huge maces which they use to crush their enemies. They mostly guard naga outposts, but occasionally participate in offensive raids.
cs: Tito obávaní bojovníci jsou elitními hlídkami nág. Jsou pomalejší a více vyzbrojené než většina nág. Vládnou velkým palcátem, kterým ubíjí své nepřátele. Většinou hlídají základny nebo příbytky, ale někdy se přidávají k útočným zátahům.

source: mace
cs: palcát

source: Naga Hunter
cs: Nága lovec

source: Naga Hunters are Naga who are skilled at hunting with a bow. Since the naga are naturally resistant to poison, they have no qualms about hunting with poisoned arrows. These two foot long shafts, tipped with a potent poison, have been known to slay many kinds of prey.
cs: Lovci jsou nágy, které získaly dostatečnou zručnost v lovu lukem. Protože jsou nágy přirozeně odolné proti jedu, nemají žádné výčitky při použití jedovatých šípů. Tyto dvě stopy dlouhé střely se špičkou potřenou silným jedem usmrtí mnohé druhy kořisti...

source: sword
cs: meč

source: bow
cs: luk

source: Naga Sentinel
cs: Nága patrola

source: The heavy fighters are the elite guards of the naga. They are slower and more heavily armored than most naga and wield huge maces which they use to crush their enemies. They mostly guard naga outposts, but occasionally participate in offensive raids.
cs: Obávaní bojovníci jsou elitními hlídkami nág. Jsou pomalejší a více vyzbrojené než většina nág. Vládnou velkým palcátem, kterým ubíjí své nepřátele. Většinou hlídají základny nebo příbytky, ale někdy se přidávají k útočným zátahům.

source: Naga Warden
cs: Nága strážce

source: She Ogre
cs: Obryně

source: A bit less stupid than their male counterparts, the ogre females spend the first part of their lives learning how use herbs and minerals to cure wound and poisons, and secondly, how to apply this knowledge to the male ogres. They don't like iron weapons, but rather, they efficiently use small but hard clubs of wood, and leather slings, to defend themselves.
cs: Obryně jsou o něco chytřejší než jejich mužské protějšky. Tráví své mládí učením se, jak používat bylinky a minerály k léčení zranění a otrav, a pak také, jak tyto znalosti aplikovat na obry. Nemají rády železné zbraně, ke své obraně raději efektivně používají malé, ale tvrdé dřevěné kyje a kožené praky.

source: sling
cs: prak

source: All is lost, now that I die...
cs: Když teď umírám, je vše ztraceno...

source: Aah! I've come so... far... only... to di...
cs: Aach! Došel jsem tak... daleko... jen... abych umř...

source: Aiah! To do bad!
cs: Achich! To špatné!

source: I got caught... damned...
cs: Dostali mě... proklatci...

source: Oh no, without Croquet, who will lead us through the wild lands?
cs: Ach ne, kdo nás bez Kroketa provede divokými zeměmi?

source: I got caught... the hunter... has been... hunted...
cs: Dostali mě... lovec... byl... uloven...

source: Oh no, without Divaid, who will lead us through the wild lands?
cs: Ach ne, kdo nás bez Divaida provede divokými zeměmi?

source: You've been helpful to us, Croquet, and we'll remember you as a friend!
cs: Pomohl jsi nám, Krokete, a budeme si tě pamatovat jako přítele!

source: You led us where you promised, hunter, and we'll make sure your end was not in vain!
cs: Dovedl jsi nás tam, kam jsi slíbil, lovče, a my se postaráme, aby tvá smrt nebyla zbytečná!

source: Damn them! I'll avenge you, my little one!
cs: Ať jsou zatraceni! Pomstím tě, má maličká!

source: Damn bastards! I'll avenge you, my friend!
cs: Prokletí bastardi! Pomstím tě, můj příteli!

source: At least... it... was... not... boring...
cs: Aspoň... to... nebyla... nuda...

source: Poor dwarf! He was crazy, but he was also nice!
cs: Ubohý trpaslík! Byl bláznivý, ale taky roztomilý!

source: In my opinion... He was nice, but he was also crazy!
cs: Podle mě... Byl roztomilý, ale taky bláznivý!

source: Commander, look at the hills in the north! Last night a group of orcs camped over on the other side of the river!
cs: Veliteli, podívejte se do kopců na severu! Během včerejší noci se nad řekou utábořila skupina skřetů!

source: Unfortunately they can do so freely; beyond the river is their territory. We still must keep our eyes open; luckily they can only cross the river at the ford, and there are more than enough of us to defend it.
cs: Bohužel je to jejich právo, za řekou je jejich území. Musíme mít stále oči otevřené. Naštěstí mohou překročit řeku pouze u brodu a nás je víc než dost, abychom tomu zabránili.

source: We might not be well-enough equipped to defend against them, commander; from the east are approaching a band of armed people with a non-reassuring appearance.
cs: Možná na tom nejsme tak dobře, abychom se jim ubránili, veliteli. Z východu se blíží skupina ozbrojených lidí, kteří nevypadají přívětivě.

source: And their fame is even less reassuring than their appearance! Those approaching are the cutthroats of the Dadoc band. He came here to collect something, and it's definitely not the reward on his head.
cs: A jejich pověst je ještě zlověstnější než jejich vzhled! Jsou to hrdlořezové z Dadokovy bandy. Přišel sem něco získat a rozhodně tím není odměna za jeho hlavu.

source: What do we do, Sergeant, if the orcs and bandits attack us at the same time?
cs: Co budeme dělat, seržante, pokud na nás skřeti i bandité zaútočí najednou?

source: If necessary, we'll call the peasants, the woodsmen, and the militia to help us.
cs: V případě potřeby si povoláme na pomoc sedláky a milici.

source: You're finally here, Dadoc! If we take out the garrison then the city will be ours!
cs: Konečně jsi tady, Dadoku! Pokud odstraníme posádku, bude město naše!

source: Remember the pacts, orc; I take the food and all the valuables, you take all the slaves!
cs: Pamatuj na úmluvy, skřete. Nám připadne jídlo a všechny cennosti, vy si vezmete všechny zajatce jako otroky!

source: Those are the pacts, and now let's do it!
cs: Takže domluveno. A teď se do toho pusťme!

source: An attack on two fronts, just what we didn't want! But, at least, we have no doubts about their intentions, and we know what to do! They waited to be together to attack us; if we eliminate one of the two enemy commanders, the other will probably withdraw!
cs: Takže útok na dvou frontách. Přesně to, co jsme nechtěli! Ale alespoň jsou jejich záměry jasné a víme, co dělat! Čekali, až se sejdou, aby na nás zaútočili. Pokud zlikvidujeme jednoho z nepřátelských vůdců, druhý se pravděpodobně stáhne!

source: What's happening here? There is a fight!
cs: Co se tady děje? Tady se bojuje!

source: Glad to see you, sir cavalier! We have a little problem with some orcs and some bandits, as you can see, and your arrival is welcome, albeit unexpected!
cs: Rád vás vidím, pane jezdče! Máme trochu problém s některými skřety a bandity, jak vidíte. I když jsme vás nečekali, váš příchod je vítán!

source: Glad to see you, sir dragoon! We have a little problem with some orcs and some bandits, as you can see, and your arrival is welcome, albeit unexpected!
cs: Rád vás vidím, pane dragoune! Máme trochu problém s některými skřety a bandity, jak vidíte. I když jsme vás nečekali, váš příchod je vítán!

source: Glad to see you, cavalryman! We have a little problem with some orcs and some bandits, as you can see, and your arrival is welcome, albeit unexpected!
cs: Rád vás vidím, kavaleristo! Máme trochu problém s některými skřety a bandity, jak vidíte. I když jsme vás nečekali, váš příchod je vítán!

source: At Soradoc they have had some inkling of strange movements by orcs not part of the Northern Alliance, so they sent messengers to all the eastern villages, and I have been sent here!
cs: V Soradoku měli nějaké tušení o podivných přesunech skřetů, co nepatří do Severní aliance. Takže vyslali posly do všech východních vesnic a já jsem byl poslán sem!

source: Hm, I am surprised that they took this place into consideration, after ignoring it for so long.
cs: Hm, jsem překvapen, že vzali toto místo v úvahu, když ho tak dlouho ignorovali.

source: These are not things that the higher-ups discuss with me, of course, but the leaked rumors speak of a renewed interest, in Wesnoth, for amber, so Weldyn took the opportunity to see what the situation is here. It seems that I will have to report about a problematic situation.
cs: Nejsou to samozřejmě věci, o kterých by se mnou výše postavení diskutovali, ale ve Wesnothu prosakují zvěsti o obnoveném zájmu o jantar. Takže ve Weldynu využili příležitosti, aby zjistili, jaká je zde situace. Zdá se, že je budu muset informovat o problematickém stavu.

source: The Amber Road is now reduced to fragments of uncertain paths that cross wild areas; territories where the laws of Wesnoth are overpowered by the law of the strongest band, and they're not always gangs of humans. The river would be navigable from the eastern shores of the continent to here, but it serves as a border with the orcish territories, and no transit is granted to any kind of ships.
cs: Z Jantarové stezky už zbyly jen fragmenty nejistých cest, které křižují divoké oblasti. To jsou území, kde místo zákonů Wesnothu vládne zákon nejsilnější skupiny a nejsou to vždy lidské bandy. Řeka by byla splavná od východních břehů kontinentu až sem, ale slouží jako hranice s územím skřetů a žádným lodím po ní není povolen tranzit.

source: This state of affairs must change! That's why I was ordered to be available to the officer who serves here as the local commander.
cs: Tento stav se musí změnit! Proto jsem dostal příkaz být k dispozici důstojníkovi, který zde slouží jako místní velitel.

source: I'm afraid there is no officer here in Amoran, for a long time now; mine is the highest grade, and when I got here, less than a year ago, the commander of the... local garrison was... the private Titus.
cs: Obávám se, že tady v Amoranu se už dlouho žádný důstojník nevyskytl. Jako seržant jsem zde nejvyšší hodnost. Když jsem se sem před necelým rokem dostal, velitelem... místní posádky byl... vojín Titus.

source: Incredible! Anyway, I don't think I'm wrong by putting me on your orders, commander...?
cs: Neuvěřitelné! Každopádně si myslím, že se nemýlím, že teď spadám pod vaše rozkazy, veliteli...?

source: Sergeant Glauco at your service, sir cavalier, and I hope to be worthy of your confidence! And now let's rid out this rabble!
cs: Seržant Glauko k vašim službám, pane! Doufám, že budu hoden vaší důvěry! A teď, vyžeňme tu chátru!

source: That'd be Sergeant Glauco, sir dragoon, and I hope to be worthy of your confidence! And now let's rid out this rabble!
cs: Jsem seržant Glauko, pane! Doufám, že budu hoden vaší důvěry! A teď, vyžeňme tu chátru!
