Repository: hrubymar10/wesnoth-cs
Catalog: add-ons/wesnoth-ala.po
Languages: cs

source: Few, even among the greatest dignitaries of the realm, know that Wesnoth's eastern borders extend far beyond the Estmark Hills! All began when the Queen Li'sar, newly established on the throne, organized a series of expeditions that circumnavigated the continent of Irdya to determine its extension and establish the conformation of his coasts. One of these expeditions, commanded by the Admiral Abelardo Gozman, left Elensefar in the spring of 520 YW, heading north. After a journey of almost 2 years, almost all of them spent making surveys and doing research in the cold seas of the north, Gozman reached the eastern coasts of the continent, and then a small bay, at the mouth of a river, inhabited by a little community of nereids. The calculations made by Gozman made him suspect that the Bitter Swamp, that at the time represented the eastern limit of the human knowledge of the continent of Irdya, had to be, more or less, halfway between the eastern and the western coasts of the same continent. Then he chose a small group of men who, under the command of Captain Guberto Piegafetta and with the help of the Nereids, ascended the river to establish how far it was, to the west, its source. Gozman, for his part, considering the situation of the ships at his disposal too compromised to face who knows what situations continuing the journey to the south, resumed the road north, to return to Elensefar retracing the same route made the first leg, a route already known and so, in some sense, safer! Admiral Abelardo Gozman managed to return to Elensefar, where he arrived in the late summer of 523 YW, and when he arrived he found honors and glory, but above all he found the astonishing news that his lieutenant Guberto Piegafetta had arrived in Weldyn a couple of months before. Piegafetta, in fact, going up the Amber River (which we'll see later why it was so called), had discovered not only that the river was born from the Bitter Swamp, but it was also easily navigable almost to the swamp, at least for a small boat like the one he used to ascent it. Piegafetta took with him two things that became of great importance for the wild lands crossed by the Amber River: the first was a certain number of pieces of golden amber that the nereids were used to finding among the pebbles in the bottom of their bay; the second thing was the news that the lands he had crossed were wild, uninhabited and, above all, not claimed by anyone.
cs: Málokdo, dokonce i mezi největšími hodnostáři říše, ví, že východní hranice Wesnothu sahají daleko za Východní vrchy! Vše začalo, když královna Lisar, jež nově usedla na trůn, zorganizovala sérii expedic, které obepluly kontinent Irdya, aby určily jeho rozlohu a zjistily podobu jeho pobřeží. Jedna z těchto výprav, které velel admirál Abelardo Gozman, opustila Elensefar na jaře roku 520 w. l. a zamířila na sever. Po téměř dvouleté cestě, kterou skoro celou strávila průzkumy a výzkumy ve studených severských mořích, se Gozmanova výprava dostala k východnímu pobřeží kontinentu a poté i k malé zátoce u ústí řeky, obývané malou komunitou mořských nymf – nereid. Výpočty, které Gozman prováděl, ho přivedly k podezření, že Štiplavý močál, který v té době představoval východní hranici lidského poznání kontinentu Irdya, musí být víceméně na půli cesty mezi východním a západním pobřežím tohoto kontinentu. Gozman potom vybral malou skupinu mužů, kteří se pod velením kapitána Guberta Piegafetty a s pomocí nereid vydali proti toku řeky, aby zjistili, jak daleko na západě se nachází její pramen. Následně Gozman pokračoval v cestě. Neodvažoval se, vzhledem k náladě na lodích, jimž velel, čelit nejistým situacím, které by se mohly vynořit při cestě na jih, a tak se na zpáteční cestu do Elensefaru vydal již poznanou a v jistém smyslu bezpečnější severní cestou! Admirál Abelardo Gozman se dokázal vrátit do Elensefaru, kam dorazil koncem léta roku 523 w. l. Když připlul, dostalo se mu poct a slávy, ale především se k němu dostala úžasná zpráva, že jeho poručík Guberto Piegafetta dorazil do Weldynu již před několika měsíci. Piegafetta totiž během plavby po Jantarové řece (dále bude osvětleno, proč tak byla nazvána) zjistil nejen to, že řeka pramení ve Štiplavém močálu, ale také, že je snadno splavná až téměř k bažině, alespoň pro malý člun, jako byl ten, na kterém plul. Piegafetta s sebou přivezl dvě věci velké důležitosti, charakterizující divokou krajinu kolem Jantarové řeky. První věcí bylo několik kusů zlatého jantaru, které nereidy běžně nacházely mezi oblázky na dně svého zálivu. Druhou věcí byla okolnost, že země, co prošel, jsou divoké, neobydlené a hlavně si je nikdo nenárokuje.

source: While the lack of a sovereignty over the wild lands immediately interested the reigning house of Wesnoth, the amber immediately interested the merchants of Soradoc. They established an outpost where the Amber River ceased to be navigable, and from the outpost began to send boats to the Nereids' Bay; the outpost soon became a prosperous town that was named Amoran. Problems started soon with the amber trade: the orcs that lived between the Amber River and the forest of Lintanir didn't look favorably at all the traffic of Wesnothians boats along the river, and acted like the orcs are used to act in these cases. There were several victims on both sides, guerrilla raids, punitive expeditions and reprisals. In the end, when the revenues of amber traffic along the river had become insufficient to support the military expenses necessary to keep it alive, a compromise was reached with the orcs. The orcs recognized the sovereignty of Wesnoth on the wilds between the Bitter Swamp and the eastern coasts of the continent, south of the Amber River, but Wesnoth had to guarantee the neutrality of the river, and both parties pledged to ban boats on the river of any kind and for any purpose. In 536 YW the same treaties were recognized as valid also by the newborn Northern Alliance. Then a caravan route was established, a path which followed, more or less, the course of the Amber River through the Wild Lands, and the amber returned to arrive at Amoran, and from here into the whole kingdom of Wesnoth. Amoran experienced a long period of prosperity, becoming a town so important as to deserve the title of Capital of the wilds, until... fashion changed!
cs: Zatímco nedostatek suverenity nad divokými zeměmi okamžitě zaujal vládnoucí rod Wesnothu, obchodníky ze Soradoku okamžitě zaujal jantar. Ti na místě, kde Jantarová řeka přestávala být splavná, založili základnu a z ní začali posílat čluny do Nereidského zálivu. Základna se brzy stala prosperujícím městem, které bylo pojmenováno Amoran. Problémy začaly brzy po ustavení obchodu s jantarem. Skřeti, kteří žili mezi Jantarovou řekou Lintanirským lesem, se na veškerý říční provoz wesnothských člunů nedívali příznivě a chovali se tak, jak jsou skřeti v těchto případech zvyklí jednat. Na obou stranách bylo několik obětí a objevily se různé partyzánské nájezdy, trestné výpravy i represálie. Nakonec, když příjmy z dopravy jantaru podél řeky přestaly stačit na pokrytí vojenských výdajů nezbytných k udržení říčního provozu, bylo se skřety dosaženo kompromisu. Skřeti uznali suverenitu Wesnothu v divočině jižně od Jantarové řeky, v oblasti mezi Štiplavým močálem a východním pobřežím kontinentu, ale Wesnothské království muselo zaručit neutralitu řeky. Obě strany se zavázaly neprovozovat říční dopravu jakéhokoli druhu a pro jakýkoli účel. V roce 536 w. l. byly stejné smlouvy potvrzeny také nově zrozenou Severní aliancí. Následně byla zřízena karavanní stezka, která víceméně sledovala tok Jantarové řeky přes Divočinu. Tak se jantar vrátil do Amoranu a odtud do celého království Wesnoth. Amoran zažil dlouhé období prosperity a stal se městem tak významným, že si zasloužil titul hlavní město Divočiny, dokud... se móda nezměnila!

source: Wesnoth's nobles and rich grew tired of amber, and for their own delight, the vanity of their kind consorts, and the pleasure of their keen lovers, they began to prefer the multi-colored precious stones that the dwarves pulled out of their mountains, and that were gotten more easily and with fewer vicissitudes than the amber coming into their hands. With the decline, and finally the cessation, of the traffic of the amber, Amoran also declined, as slowly and dignifiedly as an old lady. The population gradually decreased, the trades ended, the stone walls became too expensive to maintain, and where they collapsed they were replaced by wooden palisades. The garrison, once numerous, was reduced to a handful of soldiers, carefully chosen among those who, for lack of money and of rank, had fewer means to oppose the assignment of such a disagreeable destination. The cultivated fields became the only source of wealth of the inhabitants, and there was a thinning-out of the coins in circulation, and also the merchants thinned out. The only element of the anthropological landscape not to suffer a dramatic decline were the brigands, who became, however, more desperate, and therefore more ferocious than before! Amoran retained the title of capital, but was effectively subjected to the authority of the more important city of Soradoc, but Soradoc was far away, and Amoran was beyond the swamp, beyond the hills, beyond, above all, the interest of the Soradoc's authorities... so imagine how distant Amoran became from the interest of those who governed Weldyn. The town, now reduced to a village, had become so unimportant that it wasn't affected by the great invasion of undead of 625 YW, even if it seemed to have been born in the nearby Estmark Hills. That was a good thing, because, otherwise, in no way could Amoran have survived to those calamitous events! Instead it survived, and... another day, another time, the wind changed!
cs: Wesnothským šlechticům a boháčům se jantar omrzel. Pro své vlastní potěšení, marnivost svých laskavých manželek a radost svých horlivých milenek začali dávat přednost pestrobarevným drahým kamenům, které trpaslíci kutali ze svých hor a které bylo možné získat snadněji než jantar, jenž se jim dostával do rukou s mnohem většími peripetiemi. S poklesem a nakonec i zastavením dopravy jantaru upadal i Amoran, pomalu a důstojně jako stará dáma. Počet obyvatel postupně ubýval, živnosti končily, kamenné zdi byly příliš drahé na údržbu a tam, kde se zřítily, byly nahrazeny dřevěnými palisádami. Posádka, kdysi početná, se zredukovala na hrstku vojáků, pečlivě vybraných z těch, kteří kvůli nedostatku peněz a postavení nemohli odmítnout tuto nepříjemnou službu. Obdělávaná pole se stala jediným zdrojem bohatství obyvatel, došlo k poklesu finančních toků a také k prořídnutí řad obchodníků. Jediným prvkem civilizované krajiny, který neutrpěl tak dramatický úpadek, byli lupiči. Ti se však stali zoufalejšími, a tedy zuřivějšími než dříve! Amoran si udržel titul hlavního města provincie, byl ale fakticky podřízen autoritě důležitějšího města Soradoku. Ale Soradok byl daleko. Amoran byl za močálem, za kopci, ale především za obzorem zájmu autorit Soradoku. A tak si lze představit, jak se Amoran vzdálil zájmu těch, kteří vládli ve Weldynu. Město, nyní zredukované na vesnici, se stalo tak nedůležitým, že ho nepostihla velká invaze nemrtvých roku 625 w. l., přestože nejspíš začala v nedalekých Východních vrších. To bylo štěstí, protože by Amoran v žádném případě nemohl tyto katastrofální události přežít! Obec přežila a... v jiný den, v jiném čase došlo k náhlé změně poměrů!

source: This is the story of a bold young man named Glauco, whose fresh nomination as a sergeant counterbalanced the sending, as commander, to the meager garrison of Amoran. Others would have despaired, and not wrongly, Glauco, instead realized that for a sergeant without a name and without money, as he was, that command could be the occasion of his life to make a name for himself! He departed full of enthusiasm and arrived at his destination full of ideas, all unworkable, matured in two weeks of travel. As soon as he arrived, and after the initial discouragement that gave him the resigned appearance of the town and the miserable composition of the garrison placed under his command, he rolled up his sleeves and said to himself: I will show my worth, at the first occasion! After a few very long and very boring months, the opportunity finally presented itself, but it didn't have a beautiful face at all.
cs: Toto je příběh odvážného mladého muže jménem Glauko, jehož čerstvé jmenování seržantem bylo protiváhou jeho velitelského umístění do skrovné posádky Amoranu. Jiní by si zoufali, a ne neprávem, Glauko si místo toho uvědomil, že pro seržanta beze jména a bez peněz, jakým je on, by tento příkaz mohl být příležitostí k tomu, aby si udělal jméno! Odjížděl plný nadšení a do cíle dorazil plný nápadů, vyzrálých během dvoutýdenního cestování, avšak nerealizovatelných. Když dorazil, zažil počáteční sklíčení, které v něm vyvolal rezignovaný vzhled města a mizerné složení posádky pod jeho velením. Ale pak si vyhrnul rukávy a řekl si: při první příležitosti ukážu svou cenu! Po několika velmi dlouhých a velmi nudných měsících se konečně taková šance naskytla. Nebyla ale vůbec přívětivá.

source: Having defeated Grunto the Orc, Glauco thought it was time to settle the accounts with Dadoc and his band. The arrival of Geobard with orders of Wesnoth allowed Glauco to leave peasants and woodcutters to their jobs and to enlist other soldiers. When he felt he had enough soldiers, that is, when he didn't have any more money available, he set off towards the forest in which, as everyone knew, Dadoc took refuge to lick his wounds, as in this case, or to enjoy the fruits of his raids.
cs: Poté, co porazil skřeta Grunta, si Glauko usmyslel, že je čas vyrovnat účty s Dadokem a jeho bandou. Příchod Geobarda s rozkazy z Wesnothu umožnil Glaukovi získat další vojáky a ponechat sedláky a dřevorubce jejich práci. Když cítil, že má dostatek vojáků, tedy když už na ně neměl k dispozici další peníze, vydal se směrem k lesu. Do toho se, jak všichni věděli, uchyloval Dadok, aby si užil plody svých nájezdů nebo, jako v tomto případě, aby si olízal své rány.

source: But, having departed with plenty of enthusiasm, our sergeant lost much of his boldness when he found himself on the edge of the forest; there was no trace of paths anywhere, and the trunks of the trees were so thick as to look like the walls of a fortress, so the question arose of how to find someone in a similar green jumble. 'Meanwhile, let's mount a camp for the night,' he told himself, 'Tomorrow we'll see what to do.'
cs: Ačkoli náš seržant vyrazil s velkým nadšením, ztratil mnoho ze své smělosti, když se ocitl na kraji lesa. Po cestičkách nebylo nikde ani stopy a kmeny stromů byly tak tlusté, že vypadaly jako hradby pevnosti. Takže vyvstala otázka, jak někoho v podobné zelené změti najít. „Zatím postavíme tábor na noc,“ řekl si, „a zítra uvidíme, co dělat.“

source: With Dadoc's gang out of the games, and emboldened by the victory obtained and by his new commander prerogatives, Glauco decided to face at least one of others Amoran's problems, that's to say Grunto the orc; as Grunto was not a member of the tribes associated with the Northern Alliance, it would be unlikely that other orcish chiefs would help him, especially now that he had already been defeated in the previous battle, and therefore he saw his reputation finish, as it's called among the orcs, in a troll latrine. However, emboldening had not meant that he had become stupid, for the young sergeant. A campaign in hostile territory, against forces with only partly-known numbers, was, however, risky and full of unknowns.
cs: Poté, co se Dadokova banda ocitla mimo hru, se Glauko, povzbuzen dosaženým vítězstvím a svými novými velitelskými výsadami, rozhodl čelit alespoň jednomu z dalších problémů Amoranu, a to skřetovi Gruntovi. Protože Grunto nebyl členem kmenů spojených se Severní aliancí, bylo nepravděpodobné, že by mu jiní skřetí náčelníci pomohli. A zvláště teď, když už byl poražen v předchozí bitvě, a tak mohl vidět, jak jeho pověst mezi skřety padá jak to lejno do trollí latríny. Toto povzbuzení však pro mladého seržanta neznamenalo, že by přestal být obezřetným. Neboť tažení na nepřátelském území proti neznámému počtu sil protivníka bylo stále riskantní a plné nejistot.

source: So Glauco decided only to rely on professional soldiers, who would not fall in panic in the face of the fierce appearance of the orcs. When he finally crossed the ford of Amoran, he not only had reliable troops (though not too experienced ones), but he had also completely emptied the garrison's coffers, like his pockets. On the other hand, having claimed the reward on the head of Dadoc, the bold young man preferred to invest in lances, war archers, and armor, rather than spend that gold in ways more pleasant but, given the venture in which he had slipped, also less useful for keeping his head on his neck. For the sake of prudence, what remained of the original garrison was left to Amoran, so that it would recover from the fatigue of the previous battle and watch over the town against any nasty surprises!
cs: Glauko se tedy rozhodl spoléhat pouze na profesionální vojáky, kteří tváří v tvář divokému zjevu skřetů nepropadnou panice. Když konečně překročil brod u Amoranu, měl nejen spolehlivé vojáky (i když ne příliš zkušené), ale také úplně vyprázdněnou posádkovou kasu, stejně jako své kapsy. Na druhou stranu je třeba uvést, že když si odvážný mladík vyžádal odměnu za Dadokovu hlavu, raději investoval do kopí, válečných lučištníků a zbroje, než aby to zlato utratil příjemnějšími způsoby. Ty by ovšem také přinášely menší prospěch pro zachování jeho života vzhledem k podniku, do kterého se vrhnul. Z opatrnosti byla sestava, co zbyla z původní posádky, ponechána v Amoranu, aby se vzpamatovala z únavy z předchozí bitvy a hlídala město před případnými nepříjemnými překvapeními!

source: Grunto was the chief of a tribe smaller than his ambitions, and its territory was so small that it took only a few days for the Glauco's troops to arrive in sight of the orcish fort. The battle could start, but even though the orcish tribe was small, it might have been too big for the men led by Glauco!
cs: Grunto byl náčelníkem kmene menšího, než byly jeho ambice, a jeho území bylo tak malé, že Glaukovým jednotkám trvalo jen pár dní, než dorazily na dohled skřetí pevnosti. Bitva mohla začít. Ale i když byl skřetí kmen malý, mohl se stát pro muže vedené Glaukem příliš velkým!

source: Having defeated orcs and bandits, Amoran would have a period of quiet life, at least until some orcish chiefs decided to settle on the lands of Grunto, or until a new bandit boss rose. Glauco thought that this was the right time to make an attempt to re-establish the amber way. The questions was: how to do so! The Amber River was deep and navigable from the east coast of the continent to Amoran, but it also served as a border with the territories of the orcs, and the treaties stipulated with the Northern Alliance provided, to guarantee the security of the borders, that no boat could go up or down the river.
cs: Po porážce skřetů i banditů by měl žít Amoran v klidu, alespoň dokud se nějací skřetí náčelníci nerozhodnou usadit se na Gruntovo území nebo dokud nepovstane nový šéf banditů. Glauko uvažoval, že je ten správný čas pokusit se obnovit Jantarovou cestu. Otázkou bylo, jak na to? Jantarová řeka byla hluboká a splavná od východního pobřeží kontinentu po Amoran. Ale sloužila také jako hranice se skřetími teritorii, smlouvy uzavřené se Severní aliancí zaručovaly bezpečnost hranic a žádná loď nemohla plout ani proti, ani po jejím proudu.

source: The only alternative was the old caravan track, which for most of its journey supported the course of the river; but the track was in disastrous conditions, the stations were abandoned for decades and nothing was known about their state, although it was easily understood that it would not be a good state; in short, re-establishing the caravan route would have cost a fortune that the Wesnoth government would not have allocated. But Glauco had an idea to get around all these problems, only that this idea required that contacts with the Eastern Nereids would be restored.
cs: Jedinou alternativou byla stará karavanní stezka, která po většinu své cesty kopírovala tok řeky. Ale stezka byla v katastrofálním stavu, stanice byly desítky let opuštěné a o jejich stavu se nic nevědělo, i když se dalo lehce předpokládat, že dobrý nebude. Zkrátka obnovení karavanní stezky by stálo jmění, které by wesnothská vláda nepřidělila. Ale Glauko měl nápad, jak obejít všechny tyto problémy, jen ten nápad vyžadoval obnovení kontaktů s východními nereidami.

source: The only way to contact the eastern nereids was to cross the wildlands; Glauco, with the resources he could dispose, put together a small expedition, recruited $trapper_name as a guide, and entered the lands of the east following the remnants of traces that survived the degradation of the Amber Road; a few days later they came in sight of one of the most important station, and they discovered that the station was still inhabited, but it would have been better if it had not been so.
cs: Jediný způsob, jak kontaktovat východní nereidy, bylo přejít divokou krajinu. Glauko se zdroji, kterými mohl disponovat, dal dohromady malou výpravu, naverboval $trapper_name|a jako průvodce a vstoupil do východních zemí po zbytcích vyjetých stop, které přežily degradaci Jantarové stezky. O několik dní později přišli na dohled jedné z nejdůležitějších stanic a zjistili, že stanice je stále obydlená. Nicméně bylo by lepší, kdyby tomu tak nebylo.

source: Now the only obstacle separating Glauco's company from the sea was: a chain of low hills that the river literally grazed with its southern shore; not being able to overcome the river, and being too long to wander from the south, Glauco decided that they were going through the hills, looking for those steps that the ancient Amber Road used to travel in the past. But in the past those hills had been inhabited, and now they were inhabited again.
cs: Jedinou zbývající překážkou oddělující nyní Glaukovu skupinu od moře byl řetězec nízkých kopců, do kterých se řeka svým jižním břehem doslova zařezávala. Protože Glauko nebyl schopen překonat řeku a cesta jižní oklikou by byla příliš dlouhá, rozhodl se, že půjdou přes kopce a budou hledat linii, které se v minulosti prastará Jantarová stezka držela. Ale před lety byly tyto kopce obydleny a nyní byly obydleny zas.

source: Finally, the increasingly heterogeneous group of our heroes reached the end of the river, on the warm shores of the far east of the continent of Irdya. As it was in the expectations, and in the hopes, of the young commander, the eastern nereids still inhabited the lagoon just south of the mouth of the river; the problem was, for a change, that they were not alone, and as the famous proverb says... it would has been better if they had been.
cs: Konečně se stále více heterogenní skupina našich hrdinů dostala na konec řeky, na teplé břehy dalekého východu kontinentu Irdye. Naplňujíce očekávání i naděje mladého velitele, východní nereidy stále obývaly lagunu jižně od ústí řeky. Problém byl pro změnu v tom, že tam nebyly sami, a jak říká známé přísloví... bylo by lepší, kdyby byly.
