Repository: hrubymar10/wesnoth-cs
Catalog: wesnoth-steam.po
Languages: cs

source: ######## SUMMARY ########
cs: ######## SOUHRN ########

source: The Battle for Wesnoth is an open source, turn-based strategy game with a high fantasy theme. Explore the four corners of Irdya in seventeen solo campaigns and dozens of multiplayer maps, taking part in countless adventures as you go.
cs: The Battle for Wesnoth - Bitva o Wesnoth je open-source, tahová, strategická hra s fantasy tématikou. Prozkoumejte všechny čtyři kouty Irdye v sedmnácti sólových tažení a desítkách map pro více hráčů, účastnivse bezpočtu dobrodružství.

source: ######## DESCRIPTION ########
cs: ######## POPIS ########

source: The Battle for Wesnoth is an open source, turn-based strategy game with a high fantasy theme. From the plains of Weldyn to the forests of Wesmere, from the mines of Knalga to the soaring peaks of the Heart Mountains, take part in over a dozen adventures spanning centuries! Play as a young prince as he flees the encroaching forces of the Lich Lords to a new home across the sea... Delve into the blackest depths of the earth to craft a jewel of fire itself... Travel the continent in a daring quest to reclaim your rightful throne from a usurping queen... Step into the shoes of a young mage, his village beset by orcish invasion, as he seeks vengeance and immortality... Battle the undead hordes of a foul necromancer as he marches upon your capital... Lead a daring group of survivors across the blazing sands to a final confrontation with an unseen evil... The choice is up to you.
cs: The Battle for Wesnoth - Bitva o Wesnoth je open-source, tahová, strategická hra s fantasy tématikou. Z plání Weldynu do Wesmerských lesů, z dolů Knalgy k tyčícím se vrcholkům Srdcových Hor se zúčastněte více než tuctu dobrodružství! Zahrajte si jako mladý princ, který utíká před rostoucí silou nemrtvých lordů do nového domova přes moře… Vydejte se do nejtemnějších hlubin země, abyste vytvořili samotný ohnivý klenot… Procestujte celý kontinent při odvážném úsilí získat zpět svůj oprávněný trůn, kterého se zmocnila zlá královna… Vlezte si do bot mladého mága, jehož vesnice se potýká se skřetí invazí, hledajíce pomstu a nesmrtelnost… Bojujte s nemrtvými hordami zlého nekromancera, který se snaží uchvátit vaše hlavní město… Veďte odvážnou skupinu přeživších přes planoucí písky, do posledního střetu s nevídaným zlem… Výběr je na vás.

source: Then take the battle online! Choose from seven fully-balanced factions and duke it out with your friends in over 50 multiplayer maps for parties of all sizes!
cs: Pak se přidejte do online bitvy! Vyberte si ze sedmi plně vyvážených frakcí a vydejte se s přáteli na více než 50 map pro více hráčů pro týmy všech velikostí!

source: Explore hundreds of creative community-made campaigns, maps, and factions for both single and multiplayer, and try your hand at crafting your own! Wesnoth features a built-in map editor, a highly moddable engine, a simple and intuitive scripting language, and a friendly and dedicated modding community. There's no telling what adventures you'll bring to life!
cs: Prozkoumejte stovky kreativních tažení vytvořených komunitou, map a frakcí pro jednoho i více hráčů, a vyzkoušejte si vytváření vlastních výtvorů! Bitva o Wesnoth obsahuje vestavěný editor map, vysoce modifikovatelný engine, jednoduchý a intuitivní skriptovací jazyk s přátelskou a specializovanou komunitu. Nikdo neví, jaká dobrodružství dokážete přivést k životu!

source: ######## SUPPORTED PLATFORMS - MINIMUM REQUIREMENTS ########
cs: ######## PODPOROVANÉ PLATFORMY - MINIMÁLNÍ POŽADAVKY ########

source: #### OS VERSION ####
cs: #### VERZE OPERAČNÍHO SYSTÉMU ####

source: Windows 7 SP1 or later
cs: Windows 7 SP1 nebo novější

source: OS X 10.8 or later
cs: OS X 10.8 nebo novější

source: Ubuntu 16.04 or compatible
cs: Ubuntu 16.04 nebo kompatibilní

source: #### PROCESSOR ####
cs: #### PROCESOR ####

source: Dual-core 2.0 GHz or better
cs: Dual-core 2.0 GHz nebo lepší

source: #### GRAPHICS ####
cs: #### GRAFIKA ####

source: #### SOUND CARD ####
cs: #### ZVUKOVÁ KARTA####

source: #### ADDITIONAL NOTES ####
cs: #### DALŠÍ POZNÁMKY ####

source: ######## SUPPORTED PLATFORMS - RECOMMENDED REQUIREMENTS ########
cs: ######## PODPOROVANÉ PLATFORMY - DOPORUČENÉ POŽADAVKY ########

source: Ubuntu 18.04 or compatible
cs: Ubuntu 18.04 nebo kompatibilní

source: macOS 10.10 or later
cs: macOS 10.10 nebo novější

source: Dual-core 3.2 GHz or better
cs: Dual-core 3.2 GHz nebo lepší

source: ######## LEGAL INFORMATION ########
cs: ######## PRÁVNÍ INFORMACE ########
